
&НаКлиенте
Процедура ТипДляПодстановкиПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ТипДляПодстановки) Тогда
		ТипДляПодстановкиНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ТипДляПодстановкиНаСервере()
	НайденныеМетаданные = Метаданные.НайтиПоТипу(ТипДляПодстановки.Типы()[0]);
	НоваяСтрока = Объект.ТипыДанныхКоллекции.Добавить();
	НоваяСтрока.НаименованиеТипаСтрокой = НайденныеМетаданные.ПолноеИмя();
КонецПроцедуры

&НаКлиенте
Процедура ТипыДанныхКоллекцииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	Сообщить("Воспользуйтесь полем ""Тип для подстановки""");
КонецПроцедуры
