// @strict-types


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.РезультатЗапроса.Видимость			= Параметры.Свойство("Результат");
	Элементы.НастройкиФормирования.Видимость	= НЕ Параметры.Свойство("Результат");
	Элементы.ФормаВыбрать.Видимость				= НЕ Параметры.Свойство("Результат");
	
	Если НЕ Параметры.Свойство("Результат") Тогда
		
		СписокТаблиц.ЗагрузитьЗначения(Параметры.Таблицы);
		ОбщийСписокПолей.ЗагрузитьЗначения(Параметры.Поля);
		
		Для Каждого Таблица Из СписокТаблиц Цикл
			Таблица.Пометка = Истина;
		КонецЦикла;
		
		Для Каждого Поле Из ОбщийСписокПолей Цикл
			Поле.Пометка = Истина;
			ЗаполнитьЗначенияСвойств(СписокПолей.Добавить(), Поле);
		КонецЦикла;
		
	Иначе
		РезультатЗапроса = Параметры.Результат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТаблицПометкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.СписокТаблиц.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяТаблица = ТекущаяСтрока.Значение;
	
	СписокПолей.Очистить();
	
	Для Каждого Таблица Из СписокТаблиц Цикл
		
		Если НЕ Таблица.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Поле Из ОбщийСписокПолей Цикл
			Если СтрНачинаетсяС(Поле, Таблица.Значение + ".") Тогда
				ЗаполнитьЗначенияСвойств(СписокПолей.Добавить(), Поле);
			КонецЕсли;
		КонецЦикла;
			
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакончитьВыбор(Команда)
	
	ВыбранныеТаблицы	= Новый Массив;
	ВыбранныеПоля		= Новый Массив;
	
	Для Каждого Таблица Из СписокТаблиц Цикл
		Если Таблица.Пометка Тогда
			ВыбранныеТаблицы.Добавить(Таблица.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Поле Из СписокПолей Цикл
		Если Поле.Пометка Тогда
			ВыбранныеПоля.Добавить(Поле.Значение);
		КонецЕсли;
	КонецЦикла;
	
	СтруктураВозврата = Новый Структура("ОтмеченныеТаблицы, ОтмеченныеПоля, ВсеПоля", ВыбранныеТаблицы, ВыбранныеПоля, ОбщийСписокПолей.ВыгрузитьЗначения());
	
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры
