
#Область ПрограммныйИнтерфейс

Процедура ПоставитьСсылкуВОчередь(Ссылка) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.AI_ОчередьПодготовкиКВекторизации.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Ссылка = Ссылка;
	МенеджерЗаписи.ДатаПостановки = ТекущаяДатаСеанса();
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

Процедура УдалитьСсылкуИзОчереди(Ссылка) Экспорт
	
	НаборЗаписи = РегистрыСведений.AI_ОчередьПодготовкиКВекторизации.СоздатьНаборЗаписей();
	НаборЗаписи.Отбор.Ссылка.Установить(Ссылка);
	НаборЗаписи.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти