
#Область ПрограммныйИнтерфейс

Функция НачатьДиалог() Экспорт

	Возврат AI_ДиалогиКлиентСервер.СоздатьДиалог();
	
КонецФункции

Функция ЗаписьСобытия(ИдентификаторБеседы, Роль, Сообщение,
		ИдентификаторСообщения = Неопределено) Экспорт
	
	Возврат AI_ДиалогиКлиентСервер.ЗаписатьСобытие(
		ИдентификаторБеседы,
		Роль,
		Сообщение,
		ИдентификаторСообщения);
	
КонецФункции

Функция ПолучитьСообщенияДиалога(ИдентификаторБеседы, КоличествоСообщений) Экспорт
	
	Возврат AI_ДиалогиКлиентСервер.ПолучитьСообщения(
		ИдентификаторБеседы,
		КоличествоСообщений);
	
КонецФункции

#КонецОбласти
