
#Область ПрограммныйИнтерфейс

Функция НачатьДиалог() Экспорт
	
	МенеджерЗаписи = РегистрыСведений.AI_Диалоги.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИдентификаторБеседы = Новый УникальныйИдентификатор;
	МенеджерЗаписи.ИдентификаторСообщения = Новый УникальныйИдентификатор;
	МенеджерЗаписи.ИдентификатоБеседыСтрокой = Строка(МенеджерЗаписи.ИдентификаторБеседы);
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Сообщение= "Начало диалога.";
	МенеджерЗаписи.Записать(Ложь);
	
	Возврат МенеджерЗаписи.ИдентификаторБеседы;
	
КонецФункции

Функция ЗаписьСобытия(ИдентификаторБеседы, Роль, Сообщение,
		ИдентификаторСообщения = Неопределено) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.AI_Диалоги.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИдентификаторБеседы = ИдентификаторБеседы;
	МенеджерЗаписи.ИдентификатоБеседыСтрокой = Строка(МенеджерЗаписи.ИдентификаторБеседы);
	Если Не ЗначениеЗаполнено(ИдентификаторСообщения) Тогда
		ИдентификаторСообщения = Новый УникальныйИдентификатор;
	КонецЕсли;
	МенеджерЗаписи.ИдентификаторСообщения = ИдентификаторСообщения;
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Сообщение = Сообщение;
	МенеджерЗаписи.Роль = ?(ТипЗнч(Роль) = Тип("Строка"), Перечисления.AI_РольСообщения[Роль], Роль);
	МенеджерЗаписи.Записать(Ложь);
	Возврат ИдентификаторСообщения;
	
КонецФункции

Функция ПолучитьСообщенияДиалога(ИдентификаторБеседы, КоличествоСообщений) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		СтрЗаменить("ВЫБРАТЬ ПЕРВЫЕ 789159
		            |	AI_Диалоги.Период КАК Период,
		            |	AI_Диалоги.Роль КАК Роль,
		            |	AI_Диалоги.Сообщение КАК Сообщение
		            |ИЗ
		            |	РегистрСведений.AI_Диалоги КАК AI_Диалоги
		            |ГДЕ
		            |	AI_Диалоги.ИдентификаторБеседы = &ИдентификаторБеседы
		            |	И AI_Диалоги.Роль В (ЗНАЧЕНИЕ(Перечисление.AI_РольСообщения.user), ЗНАЧЕНИЕ(Перечисление.AI_РольСообщения.assistant))
		            |
		            |УПОРЯДОЧИТЬ ПО
		            |	AI_Диалоги.Период УБЫВ,
		            |	ВЫБОР
		            |		КОГДА AI_Диалоги.Роль = ЗНАЧЕНИЕ(Перечисление.AI_РольСообщения.assistant)
		            |			ТОГДА 1
		            |		ИНАЧЕ 0
		            |	КОНЕЦ УБЫВ", "789159", КоличествоСообщений);
	
	Запрос.УстановитьПараметр("ИдентификаторБеседы", ИдентификаторБеседы);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	ПеревернутыйМассив = Новый Массив;
	
	Пока Результат.Следующий() Цикл
		СтруктураЗначения = Новый Структура("Период, Роль, Сообщение", Результат.Период, нрег(Результат.Роль), Результат.Сообщение);
		ПеревернутыйМассив.Добавить(СтруктураЗначения);
	КонецЦикла;
	
	// Перевернем массив что бы добиться правильной историчности
	ИтоговыйМассив = Новый Массив;

	Индекс = ПеревернутыйМассив.Количество() - 1;
	Пока Индекс >= 0 Цикл
		ИтоговыйМассив.Добавить(ПеревернутыйМассив.Получить(Индекс));
		Индекс = Индекс - 1;
	КонецЦикла;
	
	Возврат ИтоговыйМассив;
	
КонецФункции

#КонецОбласти
