// @strict-types


#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Для скрытия команд относящихся к консоли кода
	Элементы.ОтменаТранзакции.Видимость	= Ложь;
	Элементы.ФормаСтатистика.Видимость	= Ложь;
	Элементы.КонсольКода_ГруппаСохраненные.Видимость			= Ложь;
	Элементы.ДеревоОбъектовМетаданных.Видимость					= Ложь;
	Элементы.ДеревоОбъектовМетаданныхПодробности.Видимость		= Ложь;
	Элементы.СписокАлгоритмовСохранитьТекущийАлгоритм.Видимость	= Ложь;
	Элементы.Заменить.Видимость									= Ложь;
	
	// Страница соединения таблиц
	Элементы.ГруппаСлужебнаяИнформация.Видимость	= Ложь;
	Элементы.ТипСвязи.Видимость						= Ложь;
	Элементы.ЗвуковоеОповещение.Видимость			= Ложь;
	Элементы.ВизуальныйКонструктор_ОтображатьЗапрос.Видимость	= Ложь;
	
	// Для открытия файла сохраненных алгоритмов
	ПутьКФайлу					= РеквизитФормыВЗначение("Объект").ИспользуемоеИмяФайла;
	ПапкаИсполнения				= Сред(ПутьКФайлу, 0, СтрНайти(ПутьКФайлу, "\", НаправлениеПоиска.СКонца));
	ПервоеОткрытиеКонсолиКода	= Истина;
	
	РежимДополнительнойОбработки = ПапкаИсполнения = "e1cib\tempstorage\";
	
	Если РежимДополнительнойОбработки Тогда
		Шаблон("Режим дополнительной обработки: %1", РежимДополнительнойОбработки);
	КонецЕсли;
	
	ХранимыеФайлы_ОбновитьНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ, ПринудительныйВызов = Ложь)
	//Поиск ранее сохраненных алгоритмов
	Если Не РежимДополнительнойОбработки ИЛИ ПринудительныйВызов Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеПоискаФайлов", ЭтаФорма);
		НачатьПоискФайлов(Оповещение, ПапкаИсполнения, "_conscode");
	Иначе
		// Попытка достать адрес на клиентской машине из памяти сервера
		// если нет данных в памяти попросить указать, затем записать в память на сервере
		ИмяПапки = ДанныеЛокальногоПутиИзСервера();
		
		Если ИмяПапки = Неопределено Тогда
			
			Оповещение = Новый ОписаниеОповещения("ПослеВыбораКаталога", ЭтаФорма);
			
			ДиалогВыбораПапки = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
			ДиалогВыбораПапки.Показать(Оповещение);
			
		Иначе
			
			ПапкаИсполнения = ИмяПапки;
			ПриОткрытии(Ложь, Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
	СформироватьПодсказку();
	
КонецПроцедуры

#КонецОбласти 

#Область ОБРАБОТЧИКИ_КОМАНД_ФОРМЫ

&НаКлиенте
Процедура Сохранить(Команда)
	
	СохранитьОбъектСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйОбъект(Команда)
	
	Если Объект.СсылкаНаОбъект = Неопределено Тогда
		СообщитьПользователю("Не выбран тип объекта",, "Объект.СсылкаНаОбъект");
		Возврат;
	КонецЕсли;
	
	Если ЕстьГруппы(Объект.СсылкаНаОбъект) Тогда
		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.Добавить("Элемент");
		СписокВыбора.Добавить("Группа");
		
		Результат = ВыбратьИзМеню(СписокВыбора, Элементы.НовыйОбъект);
		
		Если Результат = Неопределено Тогда
			Возврат;
		ИначеЕсли Результат.Значение = "Элемент" Тогда
			Группа = Ложь;
		Иначе
			Группа = Истина;
		КонецЕсли;
	Иначе
		Группа = Ложь;
	КонецЕсли;
	
	ЗаполнитьФормуСервер(Истина, Группа);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьОбъект(Команда)
	
	ЗаполнитьФормуСервер();
	
КонецПроцедуры

#КонецОбласти 

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаКлиенте
Процедура СсылкаНаОбъектПриИзменении(Элемент)
	
	ЗаполнитьФормуСервер();
	
КонецПроцедуры


&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ЭтоКонсольКода				= ТекущаяСтраница.Имя = "КонсольКода";
	ЭтоВизуальныйКонструктор	= ТекущаяСтраница.Имя = "ГруппаСоединениеТаблиц";
	
	Элементы.ОтменаТранзакции.Видимость							= ЭтоКонсольКода;
	Элементы.ФормаСтатистика.Видимость							= ЭтоКонсольКода;
	Элементы.ЗвуковоеОповещение.Видимость						= ЭтоКонсольКода;
	
	Элементы.ВизуальныйКонструктор_ОтображатьЗапрос.Видимость	= ЭтоВизуальныйКонструктор;
	
	Если ЭтоКонсольКода И ПервоеОткрытиеКонсолиКода Тогда
		ФайлыПоследнегоИсполнения = НайтиФайлы(ПутьКПоследнемуВыполняемомуКоду);
		Если ФайлыПоследнегоИсполнения.Количество() > 0 Тогда
			Оповещение = Новый ОписаниеОповещения("ПослеУтвержденияПодгрузкиПрошлогоКода", ЭтаФорма);
			ПоказатьВопрос(Оповещение, "Восстановить последний выполняемый запрос?", РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
		ПервоеОткрытиеКонсолиКода = Ложь;
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗавершениеРаботы И НЕ ЗакрытьФорму Тогда
		
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		
		Оповещение = Новый ОписаниеОповещения("ПослеПодтвержденияЗакрытия", ЭтаФорма);
		
		ПоказатьВопрос(Оповещение, "Вы уверены что хотите закрыть обработку?", РежимДиалогаВопрос.ДаНет,,, "Необходимо подтверждение");
	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте 
Процедура ПослеПодтвержденияЗакрытия(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗакрытьФорму = Истина;
		ЭтаФорма.Закрыть(Истина);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура НавигационнаяСсылкаПриИзменении(Элемент)
	
	Ссылка	=	СсылкаПоНавигации(НС);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Объект.СсылкаНаОбъект = Ссылка;
		История.Добавить(Ссылка, Строка(Ссылка));
	КонецЕсли;
	
	ЗаполнитьФормуСервер();
	
КонецПроцедуры


&НаКлиенте
Процедура ИсторияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Объект.СсылкаНаОбъект = Элементы.История.ТекущиеДанные.Значение;
	
	ЗаполнитьФормуСервер();
	
КонецПроцедуры


#КонецОбласти 


#Область КОНСОЛЬ_КОДА

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ


&НаКлиенте
Процедура ДеревоАлгоритмовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ДеревоАлгоритмовПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ДеревоАлгоритмов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено ИЛИ НЕ ТекущиеДанные.ЭтоГруппа Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ДеревоАлгоритмовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоАлгоритмов.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Код) Тогда
		ПроизвольныйКод.УстановитьТекст(ТекущиеДанные.Код);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ДеревоАлгоритмовПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоАлгоритмов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЦветнойТекст = ВернутьТекстHTML(ТекущиеДанные.Код, 0);
	
	Элементы.Предпросмотр.Документ.Body.InnerHTML = ЦветнойТекст;
	
КонецПроцедуры

#КонецОбласти 

#Область Обработчики_Команд

&НаКлиенте
Процедура КонсольКода_ПоказатьПодсказку(Команда)
	ПоказатьВводСтроки(Новый ОписаниеОповещения, Подсказка, "Подсказка",, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтменаТранзакции(Команда)
	ОтменаТранзакцииНажатие();
КонецПроцедуры

&НаСервере
Процедура ОтменаТранзакцииНажатие()
	
	Элементы.ОтменаТранзакции.Пометка	= НЕ Элементы.ОтменаТранзакции.Пометка;
	ВыделитьКрасным						= Элементы.ОтменаТранзакции.Пометка;
	
	Если ВыделитьКрасным Тогда
		Элементы.ОтменаТранзакции.ЦветФона = WebЦвета.Красный;
		Элементы.ОтменаТранзакции.ЦветТекста = WebЦвета.Белый;
	Иначе
		Элементы.ОтменаТранзакции.ЦветФона = ЦветаСтиля.ЦветФонаКнопки;
		Элементы.ОтменаТранзакции.ЦветТекста = ЦветаСтиля.ЦветТекстаКнопки;
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура Статистика(Команда)
	Элементы.ФормаСтатистика.Пометка = НЕ Элементы.ФормаСтатистика.Пометка;
КонецПроцедуры

&НаКлиенте
Процедура ЗвуковоеОповещение(Команда)
	Элементы.ЗвуковоеОповещение.Пометка = Не Элементы.ЗвуковоеОповещение.Пометка;
КонецПроцедуры

&НаКлиенте
Процедура УведомлениеВТелеграм(Команда)
	
	ЗначенияПроверки = Новый Массив;
	ЗначенияПроверки.Добавить("telegram_chat_id");
	ЗначенияПроверки.Добавить("telegram_api_key");
	
	ЗначенияЗаполнены = Истина;
	
	Для Каждого ЗначениеПроверки Из ЗначенияПроверки Цикл
		
		Если Не ЗначениеЗаполнено(ЭтаФорма[ЗначениеПроверки]) Тогда
			Сообщить(СтрШаблон("Перед активацией необходимо заполнить ""%1"" на вкладке настроки", ЗначениеПроверки));
			ЗначенияЗаполнены = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЗначенияЗаполнены Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.УведомлениеВТелеграм.Пометка = Не Элементы.УведомлениеВТелеграм.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура ВставкаМассиваСтрок(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаМассиваДанных", ЭтаФорма);
	
	ПоказатьВводСтроки(Оповещение, "", "Введите массив данных", , Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьБезПредзагрузки(Команда)
	
	ОчиститьСообщения();
	
	ТекущиеДанные = Элементы.ДеревоАлгоритмов.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Код) Тогда
		Успешно = Истина;
		ВыполнитьПроизвольныйКодНаСервереПосредник(ТекущиеДанные.Код, ТекущиеДанные.ИмяАлгоритма, Успешно);
		ЗвуковоеСопровождение();
		ОтправкаУведомленияВТелеграм(Успешно);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СохранитьДерево(Команда)
	СохранитьАлгоритмы();
КонецПроцедуры


&НаКлиенте
Процедура Заменить(Команда)
	
	ТекущиеДанные = Элементы.ДеревоАлгоритмов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено ИЛИ ТекущиеДанные.ЭтоГруппа Тогда
		Возврат
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеПодтвержденияЗамены", ЭтаФорма);
	
	ПоказатьВопрос(Оповещение, СтрШаблон("Алгоритм назначения ""%1"" уверены?", ТекущиеДанные.ИмяАлгоритма), РежимДиалогаВопрос.ДаНет,,,"Подтвердите");
	
КонецПроцедуры


&НаКлиенте
Процедура УдалитьГруппу(Команда)
	
	ТекущиеДанные = Элементы.ДеревоАлгоритмов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено ИЛИ НЕ ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеПодтвержденияУдаленияГруппы", ЭтаФорма);
	
	ПоказатьВопрос(Оповещение, СтрШаблон("Вы действительно хотите удалить группу ""%1"" и все алгоритмы содержащиеся в ней?", ТекущиеДанные.ИмяАлгоритма), РежимДиалогаВопрос.ДаНет,,,"Подтвердите действие");
	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьГруппу(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаИмениГруппы", ЭтаФорма);
	
	ПоказатьВводСтроки(Оповещение,"","Введите наименование группы");
	
КонецПроцедуры


&НаКлиенте
Процедура УдалитьАлгоритм(Команда)
	
	ТекущиеДанные	= Элементы.ДеревоАлгоритмов.ТекущиеДанные;
	
	Если ДеревоАлгоритмов.ПолучитьЭлементы().Количество() = 0 ИЛИ ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение		= Новый ОписаниеОповещения("ПослеПодтвержденияУдаления", ЭтаФорма);
	ТекстВопроса	= СтрШаблон("Вы уверены что хотите удалить данный алгоритм (%1) ?", ТекущиеДанные.ИмяАлгоритма);
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,," Подтвердите удаление");
	
КонецПроцедуры


&НаКлиенте
Процедура СохранитьТекущийАлгоритм(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаНазванияАлгоритма", ЭтаФорма);
	
	ПоказатьВводСтроки(Оповещение, "");
	
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьПроизвольныйКод(Команда)
	
	ОчиститьСообщения();
	
	Если СтрНайти(нрег(ПроизвольныйКод.ПолучитьТекст()), "текущийобъект") > 0 И НЕ ЗначениеЗаполнено(Объект.СсылкаНаОбъект) Тогда
		Сообщить("Не выбрана ссылка на объект!");
		Возврат;
	КонецЕсли;	
	
	ВыделенныйТекст = Элементы.ПроизвольныйКод.ВыделенныйТекст;
	
	ТекстВыполнения = ?(ЗначениеЗаполнено(ВыделенныйТекст), ВыделенныйТекст, ПроизвольныйКод.ПолучитьТекст());
	
	Если ЗначениеЗаполнено(ТекстВыполнения) Тогда
		Сохраняемое = ЗначениеВИзСтроки(ТекстВыполнения, Истина);
		Файл = Новый ТекстовыйДокумент;
		Файл.УстановитьТекст(Сохраняемое);
		
		Попытка
			Файл.Записать(ПутьКПоследнемуВыполняемомуКоду);
		Исключение
			Сообщить("Ошибка записи файла last_execution");
		КонецПопытки;
	КонецЕсли;
	
	Успешно = Истина;
	
	ВыполнитьПроизвольныйКодНаСервереПосредник(ТекстВыполнения, , Успешно);
	
	ОтправкаУведомленияВТелеграм(Успешно);
	ПодключитьОбработчикОжидания("ЗвуковоеСопровождение", 0.1, Истина);
	
КонецПроцедуры

&НаСервере
Функция ЗначениеВИзСтроки(Значение, Внуть)
	
	Если Внуть Тогда
		Возврат ЗначениеВСтрокуВнутр(Значение);
	Иначе
		Возврат ЗначениеИзСтрокиВнутр(Значение);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура КонсольКода_ПоказатьСкрытьСохраненные(Команда)
	
	КонсольКода_ПоказатьСкрытьСохраненныеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КонсольКода_ДеревоМетаданных(Команда)
	КонсольКода_ДеревоМетаданныхНаСервере();
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#Область ВспомогательныеФункции

&НаСервере
Функция СН(СтрокаНавигации) //Обертка для сокращения
	Возврат СсылкаПоНавигации(СтрокаНавигации);
КонецФункции

&НаСервере
Функция НС(Ссылка)
	Возврат ПолучитьНавигационнуюСсылку(Ссылка)
КонецФункции


&НаСервере
Функция СсылкаПоНавигации(СтрокаНавигации)
    
    ПерваяТочка = Найти(СтрокаНавигации, "e1cib/data/");
    ВтораяТочка = Найти(СтрокаНавигации, "?ref=");
    
    ПредставлениеТипа   = Сред(СтрокаНавигации, ПерваяТочка + 11, ВтораяТочка - ПерваяТочка - 11);
    ШаблонЗначения = ЗначениеВСтрокуВнутр(ПредопределенноеЗначение(ПредставлениеТипа + ".ПустаяСсылка"));
    ЗначениеСсылки = СтрЗаменить(ШаблонЗначения, "00000000000000000000000000000000", Сред(СтрокаНавигации, ВтораяТочка + 5));
    Ссылка = ЗначениеИзСтрокиВнутр(ЗначениеСсылки);
	
	Возврат Ссылка;
	
КонецФункции


&НаКлиенте
Процедура Закомментировать(Команда)
	Перем ПерваяСтрока, ПерваяКолонка, ПоследняяСтрока, ПоследняяКолонка;
	
	Элемент = Элементы.ПроизвольныйКод;
	Элемент.ПолучитьГраницыВыделения(ПерваяСтрока, ПерваяКолонка, ПоследняяСтрока, ПоследняяКолонка);

	ТекстДоИзменения = ПроизвольныйКод.ПолучитьТекст();
	КоличествоСтрок = СтрЧислоСтрок(ТекстДоИзменения);
	ВыделенныйФрагмент = "";
	ДлинаПоследнейСтроки = 0;
	
	Если ПоследняяКолонка = 1 Тогда 
		ПоследняяСтрока = ПоследняяСтрока - 1;
	КонецЕсли;
	Если ПерваяСтрока >= ПоследняяСтрока И ПоследняяКолонка = 1 Тогда 
		ПоследняяКолонка = СтрДлина(СтрПолучитьСтроку(ТекстДоИзменения, ПерваяСтрока));
		ПоследняяСтрока = ПерваяСтрока;
	КонецЕсли;
	
	Для НомерСтроки = 1 По КоличествоСтрок Цикл
		Фрагмент = СтрПолучитьСтроку(ТекстДоИзменения, НомерСтроки);
		Если НомерСтроки >= ПерваяСтрока И НомерСтроки <= ПоследняяСтрока Тогда
			Если НомерСтроки = ПерваяСтрока Тогда 
				ВыделенныйФрагмент = ВыделенныйФрагмент + "//" + Фрагмент;
			Иначе
				ВыделенныйФрагмент = ВыделенныйФрагмент + Символы.ПС + "//" +Фрагмент;
			КонецЕсли;
			Если НомерСтроки = ПоследняяСтрока Тогда 
				ДлинаПоследнейСтроки = СтрДлина(Фрагмент) + 3;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ПоследняяКолонка = 1 Тогда 
		ПоследняяСтрока = ПоследняяСтрока + 1;
		ДлинаПоследнейСтроки = 1;
		ВыделенныйФрагмент =  ВыделенныйФрагмент + Символы.ПС;
	КонецЕсли;

	Элемент.УстановитьГраницыВыделения(ПерваяСтрока, 1, ПоследняяСтрока, ДлинаПоследнейСтроки);
	Элемент.ВыделенныйТекст = ВыделенныйФрагмент;
	Элемент.УстановитьГраницыВыделения(ПерваяСтрока, 1, ПоследняяСтрока, ДлинаПоследнейСтроки);
КонецПроцедуры


&НаКлиенте
Процедура Раскомментировать(Команда)
	Перем ПерваяСтрока, ПерваяКолонка, ПоследняяСтрока, ПоследняяКолонка;
	Элемент = Элементы.ПроизвольныйКод;
	Элемент.ПолучитьГраницыВыделения(ПерваяСтрока, ПерваяКолонка, ПоследняяСтрока, ПоследняяКолонка);
	
	ТекстДоИзменения = ПроизвольныйКод.ПолучитьТекст();
	КоличествоСтрок = СтрЧислоСтрок(ТекстДоИзменения);
	ВыделенныйФрагмент = "";
	ДлинаПоследнейСтроки = ПоследняяКолонка;
	
	Если ПоследняяКолонка = 1 Тогда 
		ПоследняяСтрока = ПоследняяСтрока - 1;
	КонецЕсли;
	Если ПерваяСтрока >= ПоследняяСтрока И ПоследняяКолонка = 1 Тогда 
		ПоследняяКолонка = СтрДлина(СтрПолучитьСтроку(ТекстДоИзменения, ПерваяСтрока));
		ПоследняяСтрока = ПерваяСтрока;
	КонецЕсли;

	Для НомерСтроки = 1 По КоличествоСтрок Цикл
		Фрагмент = СтрПолучитьСтроку(ТекстДоИзменения, НомерСтроки);
		Если НомерСтроки >= ПерваяСтрока И НомерСтроки <= ПоследняяСтрока Тогда
			Если Лев(СокрЛ(Фрагмент), 2) = "//" Тогда
				Позиция = Найти(Фрагмент, "//");
				Фрагмент = Лев(Фрагмент, Позиция - 1) + Сред(Фрагмент, Позиция + 2);
			КонецЕсли;
			Если НомерСтроки = ПерваяСтрока Тогда 
				ВыделенныйФрагмент = ВыделенныйФрагмент + Фрагмент;
			Иначе
				ВыделенныйФрагмент = ВыделенныйФрагмент + Символы.ПС + Фрагмент;
			КонецЕсли;
			Если НомерСтроки = ПоследняяСтрока Тогда 
				ДлинаПоследнейСтроки = СтрДлина(Фрагмент) + 3;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ПоследняяКолонка = 1 Тогда 
		ПоследняяСтрока = ПоследняяСтрока + 1;
		ДлинаПоследнейСтроки = 1;
		ВыделенныйФрагмент =  ВыделенныйФрагмент + Символы.ПС;
	КонецЕсли;

	Элемент.УстановитьГраницыВыделения(ПерваяСтрока, 1, ПоследняяСтрока, ДлинаПоследнейСтроки);
	Элемент.ВыделенныйТекст = ВыделенныйФрагмент;
	Элемент.УстановитьГраницыВыделения(ПерваяСтрока, 1, ПоследняяСтрока, ДлинаПоследнейСтроки);
КонецПроцедуры


&НаСервере
Функция ПолнаяКопияОбъекта(ОбъектИсточник)
	
	МетаданныеОбъекта = ОбъектИсточник.Метаданные();
	
	КопияОбъекта = ОбъектИсточник.Скопировать();
	
	ЗаполнитьЗначенияСвойств(КопияОбъекта, ОбъектИсточник);
	
	Для Каждого ТабличнаяЧасть Из МетаданныеОбъекта.ТабличныеЧасти Цикл
		
		КопияОбъекта[ТабличнаяЧасть.Имя].Загрузить(ОбъектИсточник[ТабличнаяЧасть.Имя].Выгрузить());
		
	КонецЦикла;
	
	Возврат КопияОбъекта;
	
КонецФункции

#КонецОбласти 

#Область ОБРАБОТЧИКИ_ОПОВЕЩЕНИЙ

&НаКлиентеНаСервереБезКонтекста
Функция ТекстДляКонфигуратора(Текст)
	
	Результат = """";
	ПереводСтроки = Символы.ВК+Символы.ПС;
	Для Счетчик = 1 По СтрЧислоСтрок(Текст) Цикл
		ТекСтрока = СтрПолучитьСтроку(Текст, Счетчик);
		Если Счетчик > 1 Тогда 
			ТекСтрока = СтрЗаменить(ТекСтрока,"""","""""");
			Результат = Результат + ПереводСтроки + "|"+ ТекСтрока;
		Иначе
			ТекСтрока = СтрЗаменить(ТекСтрока,"""","""""");
			Результат = Результат + ТекСтрока;
		КонецЕсли;
	КонецЦикла;
	Результат = Результат + """";
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПослеВводаМассиваДанных(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		РезультатОбработки = "МногомернаяСтрока = " + Символы.ПС;
		ИтогОбработки = ТекстДляКонфигуратора(Результат);
		
		Итог = РезультатОбработки + ИтогОбработки + ";";
		Итог = Итог + "
		|
		|МассивДанных	= СтрРазделить(МногомернаяСтрока, Символы.ПС, Истина);
		|
		|Для Каждого ДанныеИзМассива Из МассивДанных Цикл
		|	Сообщить(ДанныеИзМассива);
		|КонецЦикла;";
		
		ПоказатьВводСтроки(Новый ОписаниеОповещения, Итог,,, Истина);
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеПодтвержденияЗамены(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) И Результат = КодВозвратаДиалога.Да Тогда
		
		ТекущиеДанные =  Элементы.ДеревоАлгоритмов.ТекущиеДанные;
		
		ТекущиеДанные.Код = ПроизвольныйКод.ПолучитьТекст();
		
		СохранитьАлгоритмы();
		
		Состояние("Заменено");
		
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		
		Состояние("Отменено");
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеПодтвержденияУдаленияГруппы(Результат, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = Элементы.ДеревоАлгоритмов.ТекущиеДанные;
	
	Если Результат = КодВозвратаДиалога.Нет ИЛИ НЕ ТекущиеДанные.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьГруппуНаСервере(ТекущиеДанные.УИД);
	
	СохранитьАлгоритмы();
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеВводаИмениГруппы(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьУзелДереваАлгоритмов(Результат);
	
	СохранитьАлгоритмы();
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеПодтвержденияУдаления(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	УИД = Элементы.ДеревоАлгоритмов.ТекущиеДанные.УИД;
	
	УдалитьАлгоритмНаСервере(УИД);
	
	СохранитьАлгоритмы();
	
	Состояние("Удалено");
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеВводаНазванияАлгоритма(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	НовыйАлгоритм = Новый Структура("ИмяАлгоритма, УИД, Код");
	НовыйАлгоритм.ИмяАлгоритма = Результат;
	НовыйАлгоритм.УИД = Новый УникальныйИдентификатор;
	НовыйАлгоритм.Код = ПроизвольныйКод.ПолучитьТекст();
	
	ТекущиеДанные = Элементы.ДеревоАлгоритмов.ТекущиеДанные;
	
	ДеталиДобавления	= Новый Структура("УИД, ЭтоГруппа") ;
	ЗаполнитьЗначенияСвойств(ДеталиДобавления, ТекущиеДанные);
	
	ДобавитьАлгоритмВУзел(НовыйАлгоритм, ДеталиДобавления);
	
	СохранитьАлгоритмы();
	
	Состояние("Алгоритм записан");
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеПоискаФайлов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Количество() > 0 Тогда
		
		ДД = Новый ДвоичныеДанные(Результат[0].ПолноеИмя);
		
		Адрес = ПоместитьВоВременноеХранилище(ДД, ЭтаФорма.УникальныйИдентификатор);
		
		ЗагрузитьАлгоритмыНаСервере(Адрес);
		
	КонецЕсли;
	
	ПутьКПоследнемуВыполняемомуКоду = ПапкаИсполнения + "last_execution";
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеУтвержденияПодгрузкиПрошлогоКода(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Файл = Новый ТекстовыйДокумент;
		Файл.Прочитать(ПутьКПоследнемуВыполняемомуКоду);
		ПроизвольныйКод.УстановитьТекст(ЗначениеВИзСтроки(Файл.ПолучитьТекст(), Ложь));
		
		УдалитьФайлы(ПутьКПоследнемуВыполняемомуКоду);
		
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		
		УдалитьФайлы(ПутьКПоследнемуВыполняемомуКоду);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКаталога(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		ПапкаИсполнения = Результат[0];
		
		ДанныеЛокальногоПутиИзСервера(ПапкаИсполнения + "\");
		
		ПутьКПоследнемуВыполняемомуКоду = ПапкаИсполнения + "last_execution";
		
		ПриОткрытии(Ложь, Истина);
		
	Иначе
		
		Сообщить("Выбор каталога отменен.");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПРОЧИЕ


&НаКлиенте 
Функция ВернутьТекстHTML(пСтрокаКода, пРежим)
	
	КлючевыеСлова1 = ВернутьСтрокуКлючевыхСлов(пРежим, 1);
	КлючевыеСлова2 = ВернутьСтрокуКлючевыхСлов(пРежим, 2);
	
	Если пРежим = 0 Тогда 	//Встроенный язык
		ЦветПоУмолчанию 	= "blue";
		ЦветОператоры 		= "red";
		ЦветКлючевыеСлова 	= "red";
		ЦветКомментарии 	= "green";
		ЦветИнструкции		= "brown";
		ЦветДирективы		= "brown";
		ЦветСтроки			= "black";
		ЦветЧисла			= "black";
		ЦветДаты			= "black";
	Иначе					//Текст запроса
		ЦветПоУмолчанию 	= "black";
		ЦветОператоры 		= "red";
		ЦветКлючевыеСлова1 	= "blue";
		ЦветКлючевыеСлова2 	= "brown";
		ЦветКомментарии 	= "green";
		ЦветСтроки			= "red";
		ЦветЧисла			= "magenta";
		ЦветПараметры		= "darkcyan";
	КонецЕсли;
	
	//Назначаем стили для редактирования
	Документ = Элементы.Предпросмотр.Документ;
	Документ.body.style.fontfamily 		= "Courier New";
	Документ.body.style.fontsize 		= "10pt";
	Документ.body.style.color 			= ЦветПоУмолчанию;
	Документ.body.style.margintop 		= "0em";
	Документ.body.style.marginbottom 	= "0em";
	
	ЦветнойТекст = пСтрокаКода;
	
	RegExp = Новый ComОбъект("VBScript.RegExp");
	RegExp.Global = Истина;
	RegExp.IgnoreCase = Истина;
	RegExp.Multiline = Истина;

	//Заменяем < на &lt;
	RegExp.Pattern = "<";
	ЦветнойТекст = RegExp.Replace(ЦветнойТекст, "&lt;");
	
	Если пРежим = 0 Тогда
	
		//Строки
		RegExp.Pattern = "(?:\x22(?:[^\x22]|\x22\x22)*?\x22)";
		RegExp.Pattern = RegExp.Pattern + "|(?:\x22(?:[^\x22]|\x22\x22)*?$)"; //Неоконченная строка
		//Комментарии
		RegExp.Pattern = RegExp.Pattern + "|(?://.*$)"; 
		//Инструкции препроцессору
		RegExp.Pattern = RegExp.Pattern + "|(?:\#.*$)";
		//Директивы компиляции
		RegExp.Pattern = RegExp.Pattern + "|(?:\&(?!lt;).*$)";
		//Даты
		RegExp.Pattern = RegExp.Pattern + "|(?:'[^']*?')";
		//Операторы
		RegExp.Pattern = RegExp.Pattern + "|(?:\&lt;)|(?:[\/\,\;\-\%\<\>\?\(\)\*\+\:\[\]\.\=])";
		//Числа
		RegExp.Pattern = RegExp.Pattern + "|(?:\s|^)(?:\d+\.?\d*)";
		//Ключевые слова
		RegExp.Pattern = RegExp.Pattern + "|(?:\s|^)(?:" + КлючевыеСлова1 + ")(?![a-zа-я0-9_]|\.)";
		
		RegExp.Pattern = "(" + RegExp.Pattern + ")";
		
		ЦветнойТекст = RegExp.Replace(ЦветнойТекст, "<font color=red>$1</font>");
		
		//Заменяем строки
		RegExp.Pattern = "<font color=red>(\x22[\s\S]*?)</font>";
		ЦветнойТекст = RegExp.Replace(ЦветнойТекст, "<font color=" + ЦветСтроки + ">$1</font>");
		
		//Заменяем комментарии
		RegExp.Pattern = "<font color=red>(/.*?)</font>";
		ЦветнойТекст = RegExp.Replace(ЦветнойТекст, "<font color=" + ЦветКомментарии + ">$1</font>");
		
		//Заменяем числа
		RegExp.Pattern = "<font color=red>([\s|^]?)(\d.*?)</font>";
		ЦветнойТекст = RegExp.Replace(ЦветнойТекст, "$1<font color=" + ЦветЧисла + ">$2</font>");
		
		//Заменяем директивы
		RegExp.Pattern = "<font color=red>(&(?!lt;).*?)</font>";
		ЦветнойТекст = RegExp.Replace(ЦветнойТекст, "<font color=" + ЦветДирективы + ">$1</font>");
		
		//Заменяем инструкции
		RegExp.Pattern = "<font color=red>(#.*?)</font>";
		ЦветнойТекст = RegExp.Replace(ЦветнойТекст, "<font color=" + ЦветИнструкции + ">$1</font>");
		
		//Заменяем ключевые слова
		RegExp.Pattern = "<font color=red>(\s+)(.*?)</font>";
		ЦветнойТекст = RegExp.Replace(ЦветнойТекст, "$1<font color=" + ЦветКлючевыеСлова + ">$2</font>");
		
	Иначе
		
		//Комментарии
		RegExp.Pattern = "(?://.*$)";
		//Строки
		RegExp.Pattern = RegExp.Pattern + "|(?:\x22(?:[^\x22$]|\x22\x22)*?\x22)";
		RegExp.Pattern = RegExp.Pattern + "|(?:\x22(?:[^\x22$]|\x22\x22)*?$)";
		//Ключевые слова 1
		RegExp.Pattern = RegExp.Pattern + "|(?:\s|^)(?:" + КлючевыеСлова1 + ")(?![a-zа-я0-9_\.])";
		//Ключевые слова 2
		RegExp.Pattern = RegExp.Pattern + "|(?:\s|^)(?:" + КлючевыеСлова2 + ")(?![a-zа-я0-9_\.])";
		//Операторы1
		СтрокаОператоров1 = "\;\%\?\:\[\]\\`~!@\$^\|";
		RegExp.Pattern = RegExp.Pattern + "|(?:[" + СтрокаОператоров1 + "])";
		//Операторы2
		СтрокаОператоров2 = "\+|-|\*|/|=|&lt;|>|,|\(|\)|=";
		RegExp.Pattern = RegExp.Pattern + "|(?:" + СтрокаОператоров2 + ")";
		//Параметры
		RegExp.Pattern = RegExp.Pattern + "|(?:&[a-zа-я0-9_]*)";
		//Числа
		RegExp.Pattern = RegExp.Pattern + "|(?:\s|^)(?:\d+\.?\d*)";
		
		RegExp.Pattern = "(" + RegExp.Pattern + ")";
		
		//Выполняем основное преобразование
		ЦветнойТекст = RegExp.Replace(ЦветнойТекст, "<font color=red>$1</font>");
		
		//Заменяем комментарии
		RegExp.Pattern = "<font color=red>(/.*?)</font>";
		ЦветнойТекст = RegExp.Replace(ЦветнойТекст, "<font color=" + ЦветКомментарии + ">$1</font>");
		
		//Заменяем строки
		RegExp.Pattern = "<font color=red>(\x22.*?)</font>";
		ЦветнойТекст = RegExp.Replace(ЦветнойТекст, "<font color=" + ЦветСтроки + ">$1</font>");
		
		//Заменяем числа
		RegExp.Pattern = "<font color=red>([\s|^]?)(\d.*?)</font>";
		ЦветнойТекст = RegExp.Replace(ЦветнойТекст, "$1<font color=" + ЦветЧисла + ">$2</font>");
		
		//Заменяем ключевые слова 1
		RegExp.Pattern = "<font color=red>(\s*)(" + КлючевыеСлова1 + ")</font>";
		ЦветнойТекст = RegExp.Replace(ЦветнойТекст, "$1<font color=" + ЦветКлючевыеСлова1 + ">$2</font>");
		
		//Заменяем ключевые слова 2
		RegExp.Pattern = "<font color=red>(\s*)(" + КлючевыеСлова2 + ")</font>";
		ЦветнойТекст = RegExp.Replace(ЦветнойТекст, "$1<font color=" + ЦветКлючевыеСлова2 + ">$2</font>");
		
		//Заменяем операторы 2
		RegExp.Pattern = "<font color=red>(" + СтрокаОператоров2 + ")</font>";
		ЦветнойТекст = RegExp.Replace(ЦветнойТекст, "<font color=" + ЦветКлючевыеСлова1 + ">$1</font>");
		
		//Заменяем параметры
		RegExp.Pattern = "<font color=red>(&[a-zа-я0-9_]*)</font>";
		ЦветнойТекст = RegExp.Replace(ЦветнойТекст, "<font color=" + ЦветПараметры + ">$1</font>");
		
	КонецЕсли;
	
	//Заменяем переводы строки
	RegExp.Pattern = Символы.ПС;
	ЦветнойТекст = RegExp.Replace(ЦветнойТекст, "<br>");
	
	//Заменяем табуляцию четырьмя &nbsp;
	RegExp.Pattern = "\t";
	ЦветнойТекст = RegExp.Replace(ЦветнойТекст, "&nbsp;&nbsp;&nbsp;&nbsp;");
	
	//Заменяем четыре пробела четырьмя &nbsp;
	RegExp.Pattern = "    ";
	ЦветнойТекст = RegExp.Replace(ЦветнойТекст, "&nbsp;&nbsp;&nbsp;&nbsp;");
	
	Возврат ЦветнойТекст;
	
КонецФункции //ВернутьТекстHTML


&НаКлиенте
Функция ВернутьСтрокуКлючевыхСлов(пРежим, пНомер)
	
	Если пРежим = 0 И пНомер = 1 Тогда
		
		СтрокаКлючевыхСлов = "";
		//Циклы
		СтрокаКлючевыхСлов = СтрокаКлючевыхСлов + "для|каждого|по|из|пока|цикл|продолжить|прервать|конеццикла";
		СтрокаКлючевыхСлов = СтрокаКлючевыхСлов + "|for|each|to|in|while|do|continue|break|enddo";
		//Условия
		СтрокаКлючевыхСлов = СтрокаКлючевыхСлов + "|если|тогда|иначеесли|иначе|конецесли";
		СтрокаКлючевыхСлов = СтрокаКлючевыхСлов + "|if|then|elsif|else|endif";
		//Функции/процедуры/переменные
		СтрокаКлючевыхСлов = СтрокаКлючевыхСлов + "|процедура|функция|знач|экспорт|перем|возврат|конецпроцедуры|конецфункции";
		СтрокаКлючевыхСлов = СтрокаКлючевыхСлов + "|procedure|function|val|export|var|return|endprocedure|endfunction";
		//Булевые операции
		СтрокаКлючевыхСлов = СтрокаКлючевыхСлов + "|и|или|не";
		СтрокаКлючевыхСлов = СтрокаКлючевыхСлов + "|and|or|not";
		//Примитивные типы
		СтрокаКлючевыхСлов = СтрокаКлючевыхСлов + "|истина|ложь|null|неопределено";
		СтрокаКлючевыхСлов = СтрокаКлючевыхСлов + "|true|false|null|undefined";
		//Попытка/исключение
		СтрокаКлючевыхСлов = СтрокаКлючевыхСлов + "|попытка|исключение|вызватьисключение|конецпопытки";
		СтрокаКлючевыхСлов = СтрокаКлючевыхСлов + "|try|except|raise|endtry";
		//Прочие операторы
		СтрокаКлючевыхСлов = СтрокаКлючевыхСлов + "|выполнить|новый|перейти|добавитьобработчик|удалитьобработчик";
		СтрокаКлючевыхСлов = СтрокаКлючевыхСлов + "|execute|new|goto|addhandler|removehandler";
		
		Возврат СтрокаКлючевыхСлов;
		
	ИначеЕсли пРежим = 0 И пНомер = 2 Тогда
		
		Возврат "";
		
	ИначеЕсли пРежим = 1 И пНомер = 1 Тогда
		
		СтрокаКлючевыхСлов = "";
		СтрокаКлючевыхСлов = СтрокаКлючевыхСлов + "ВЫБРАТЬ|РАЗЛИЧНЫЕ|ПЕРВЫЕ|ИЗ|ГДЕ|КАК|УПОРЯДОЧИТЬ|ПО|АВТОУПОРЯДОЧИВАНИЕ|СГРУППИРОВАТЬ|ИТОГИ|ОБЩИЕ|ЛЕВОЕ|ПРАВОЕ|ПОЛНОЕ|ВНЕШНЕЕ|ВНУТРЕННЕЕ|СОЕДИНЕНИЕ|УБЫВ|ВОЗР|ИМЕЮЩИЕ|ОБЪЕДИНИТЬ|ВСЕ|ДЛЯ|ИЗМЕНЕНИЯ|ПОМЕСТИТЬ|ИНДЕКСИРОВАТЬ|УНИЧТОЖИТЬ|БУЛЕВО|ЧИСЛО|ТОЛЬКО|ИЕРАРХИЯ|ПЕРИОДАМИ";
		СтрокаКлючевыхСлов = СтрокаКлючевыхСлов + "|ЗНАЧЕНИЕ|ТИП|РАЗЛИЧНЫЕ|ТИПЗНАЧЕНИЯ";
		Возврат СтрокаКлючевыхСлов;
		
	ИначеЕсли пРежим = 1 И пНомер = 2 Тогда
		
		СтрокаКлючевыхСлов = "";
		//Функции работы со строками
		СтрокаКлючевыхСлов = СтрокаКлючевыхСлов + "ПОДСТРОКА";
		//Функции работы с датами
		СтрокаКлючевыхСлов = СтрокаКлючевыхСлов + "|ГОД|КВАРТАЛ|МЕСЯЦ|ДЕНЬГОДА|ДЕНЬ|НЕДЕЛЯ|ДЕНЬНЕДЕЛИ|ЧАС|МИНУТА|СЕКУНДА|НАЧАЛОПЕРИОДА|КОНЕЦПЕРИОДА|ДОБАВИТЬКДАТЕ|РАЗНОСТЬДАТ|ДАТАВРЕМЯ";
        //Агрегатные функции
		СтрокаКлючевыхСлов = СтрокаКлючевыхСлов + "|СУММА|МИНИМУМ|МАКСИМУМ|СРЕДНЕЕ|КОЛИЧЕСТВО";
		//Прочие функции
		СтрокаКлючевыхСлов = СтрокаКлючевыхСлов + "|ЕСТЬNULL|ПРЕДСТАВЛЕНИЕ|ПРЕДСТАВЛЕНИЕССЫЛКИ|СПЕЦСИМВОЛ";
        //Логические операторы
		СтрокаКлючевыхСлов = СтрокаКлючевыхСлов + "|И|ИЛИ|НЕ|ПОДОБНО|В|ИЕРАРХИИ|МЕЖДУ|ЕСТЬ|ССЫЛКА";
		//Прочие операторы
		СтрокаКлючевыхСлов = СтрокаКлючевыхСлов + "|ВЫБОР|КОГДА|ТОГДА|ИНАЧЕ|КОНЕЦ|ВЫРАЗИТЬ";
		//Константы
		СтрокаКлючевыхСлов = СтрокаКлючевыхСлов + "|ИСТИНА|ЛОЖЬ|NULL|НЕОПРЕДЕЛЕНО";
		
		Возврат СтрокаКлючевыхСлов
		
	КонецЕсли;
	
КонецФункции //ВернутьСтрокуКлючевыхСлов


&НаКлиенте
Процедура СохранитьАлгоритмы()
	
	АдресДД	= АдресДанныхВоВременномХранилище();
	ДД		= ПолучитьИзВременногоХранилища(АдресДД);
	
	ДД.Записать(ПапкаИсполнения + "_conscode");
	
	Состояние("Записано");
	
КонецПроцедуры


&НаСервере
Функция АдресДанныхВоВременномХранилище()
	
	ИмяВременногоФайла	= ПолучитьИмяВременногоФайла();
	ДеревоОбъект		= РеквизитФормыВЗначение("ДеревоАлгоритмов");
	
	ЗначениеВФайл(ИмяВременногоФайла, ДеревоОбъект);
	
	ДД		= Новый ДвоичныеДанные(ИмяВременногоФайла);
	Адрес	= ПоместитьВоВременноеХранилище(ДД,ЭтаФорма.УникальныйИдентификатор);
	
	Возврат Адрес;
	
КонецФункции


&НаСервере
Процедура УдалитьАлгоритмНаСервере(УИД)
	
	ДеревоОбъект = РеквизитФормыВЗначение("ДеревоАлгоритмов");
	НужнаяСтрока = НайтиВДеревеПоУИДУ(ДеревоОбъект, УИД);
	
	Если НЕ ЗначениеЗаполнено(НужнаяСтрока.Родитель) Тогда
		Владелец = ДеревоОбъект;
	Иначе
		Владелец = НужнаяСтрока.Родитель;
	КонецЕсли;
	
	Владелец.Строки.Удалить(НужнаяСтрока);
	
	ЗначениеВРеквизитФормы(ДеревоОбъект, "ДеревоАлгоритмов");
	
КонецПроцедуры


&НаСервере
Процедура ДобавитьУзелДереваАлгоритмов(ИмяУзла)
	
	ДеревоОбъект		= РеквизитФормыВЗначение("ДеревоАлгоритмов");
	НовыйАлгоритм		=	ДеревоОбъект.Строки.Добавить();
	НовыйАлгоритм.ИмяАлгоритма	=	ИмяУзла;
	НовыйАлгоритм.УИД			=	Новый УникальныйИдентификатор;
	НовыйАлгоритм.ЭтоГруппа		=	Истина;
	
	ЗначениеВРеквизитФормы(ДеревоОбъект, "ДеревоАлгоритмов");
	
КонецПроцедуры

&НаСервере
Процедура СброситьПуть()
	
	ДанныеЛокальногоПутиИзСервера(Неопределено);
	
КонецПроцедуры

&НаСервере
Функция ДанныеЛокальногоПутиИзСервера(ИмяПапкиДляСохранения = "")
	
	ИмяКлючаНастроек			= "ПутьКАлгоритмам_conscode";
	ИмяПользователя				= ПараметрыСеанса.ТекущийПользователь;
	ИмяПользователяБезПробелов	= СтрЗаменить(ИмяПользователя, " ", "_");
	
	Если ИмяПапкиДляСохранения = "" Тогда
		
		ПутьИзНастроек = ХранилищеОбщихНастроек.Загрузить(ИмяПользователяБезПробелов, "ПутьКАлгоритмам_conscode", , ИмяПользователяБезПробелов);
		
		Если ЗначениеЗаполнено(ПутьИзНастроек) Тогда
			Сообщить("Настройки успешно загружены");
			Возврат ПутьИзНастроек;
		Иначе
			Сообщить("Настройки не обнаружены");
			Возврат Неопределено;
		КонецЕсли;
		
	Иначе
		
		ХранилищеОбщихНастроек.Сохранить(ИмяПользователяБезПробелов, ИмяКлючаНастроек, ИмяПапкиДляСохранения, , ИмяПользователяБезПробелов);
		
		Сообщить("Путь сохранен на сервере");
		
	КонецЕсли;
	
КонецФункции


&НаСервере
Процедура ЗагрузитьАлгоритмыНаСервере(Адрес)
	
	ДД = ПолучитьИзВременногоХранилища(Адрес);
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	
	ДД.Записать(ИмяВременногоФайла);
	
	СохраненноеДерево = ЗначениеИзФайла(ИмяВременногоФайла);
	
	Если СохраненноеДерево = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//Для Каждого СтрокаДерева Из СохраненноеДерево.Строки Цикл
	//	СтрокаДерева.Строки.Сортировать("ИмяАлгоритма", Истина);
	//КонецЦикла;
	
	ЗначениеВРеквизитФормы(СохраненноеДерево, "ДеревоАлгоритмов");
	
КонецПроцедуры


&НаСервере
Процедура ДобавитьАлгоритмВУзел(ДанныеДобавления, ДеталиДобавления)
	
	ДеревоОбъект = РеквизитФормыВЗначение("ДеревоАлгоритмов");
	
	Если ДеталиДобавления.ЭтоГруппа Тогда
		
		// Тогда найти элемент дерева и добавить к нему в строки
		
		НовыйАлгоритм = ДеревоОбъект.Строки.НайтиСтроки(Новый Структура("УИД", ДеталиДобавления.УИД))[0].Строки.Добавить();
		
	Иначе
		
		Владелец = НайтиВДеревеПоУИДУ(ДеревоОбъект, ДеталиДобавления.УИД).Родитель;
		
		Если Владелец = Неопределено Тогда
			Владелец = ДеревоОбъект;
		КонецЕсли;
		
		НовыйАлгоритм = Владелец.Строки.Добавить();
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НовыйАлгоритм, ДанныеДобавления);
	
	ЗначениеВРеквизитФормы(ДеревоОбъект, "ДеревоАлгоритмов");
	
КонецПроцедуры


&НаСервере
Функция НайтиВДеревеПоУИДУ(Дерево, УИД, Результат = "")
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		
		Если СтрокаДерева.УИД = УИД Тогда
			Результат = СтрокаДерева;
			Возврат Результат;
		Иначе
			НайтиВДеревеПоУИДУ(СтрокаДерева, УИД, Результат);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
		
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Шаблон(Знач ШаблонСтроки, 
	Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено) Экспорт
	
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%1", Параметр1);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%2", Параметр2);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%3", Параметр3);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%4", Параметр4);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%5", Параметр5);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%6", Параметр6);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%7", Параметр7);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%8", Параметр8);
	ШаблонСтроки = СтрЗаменить(ШаблонСтроки, "%9", Параметр9);
	
	Сообщить(ШаблонСтроки);
	
	Возврат ШаблонСтроки;
	
КонецФункции


&НаСервере
Процедура УдалитьГруппуНаСервере(УИД)
	
	ДеревоОбъект	= РеквизитФормыВЗначение("ДеревоАлгоритмов");
	
	УзелДерева		= ДеревоОбъект.Строки.НайтиСтроки(Новый Структура("УИД", УИД))[0];
	
	ДеревоОбъект.Строки.Удалить(УзелДерева);
	
	ЗначениеВРеквизитФормы(ДеревоОбъект, "ДеревоАлгоритмов");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗвуковоеСопровождение() Экспорт
	Если Элементы.ЗвуковоеОповещение.Пометка Тогда
		ГовориКлиент("Выполнено");
	Иначе
		ВыделенныйТекст = Элементы.ПроизвольныйКод.ВыделенныйТекст;
		ТекстВыполнения = ?(ЗначениеЗаполнено(ВыделенныйТекст), ВыделенныйТекст, ПроизвольныйКод.ПолучитьТекст());
		НачалоВхождения = СтрНайти(ТекстВыполнения, "говори(");
		Если НачалоВхождения Тогда
			КонецВхождения = СтрНайти(ТекстВыполнения, """);",, НачалоВхождения);
			ТекстОзвучки = Сред(ТекстВыполнения, НачалоВхождения + 7, КонецВхождения - НачалоВхождения - 7);
			ГовориКлиент(ТекстОзвучки);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаУведомленияВТелеграм(Успешно) Экспорт
	
	Если НЕ Элементы.УведомлениеВТелеграм.Пометка Тогда
		Возврат;
	КонецЕсли;
	
	ОтправитьСообщениеВТГ("Универсальная обработка: " + ?(Успешно, "Алгоритм выполнен", "Возникла ошибка при выполнении алгоритма"));
	
КонецПроцедуры

&НаКлиенте
Процедура ГовориКлиент(Текст)
	
	spVoice = Новый COMОбъект("SAPI.SpVoice");
	spVoice.speak(Текст);
	
КонецПроцедуры

&НаСервере 
Процедура КонсольКода_ПоказатьСкрытьСохраненныеНаСервере()
	Элементы.КонсольКода_ПоказатьСкрытьСохраненные.Пометка = НЕ Элементы.КонсольКода_ПоказатьСкрытьСохраненные.Пометка;
	Если Элементы.КонсольКода_ПоказатьСкрытьСохраненные.Пометка Тогда
		Элементы.КонсольКода_ПоказатьСкрытьСохраненные.ЦветФона = WebЦвета.НебесноГолубой;
	Иначе
		Элементы.КонсольКода_ПоказатьСкрытьСохраненные.ЦветФона = ЦветаСтиля.ЦветФонаКнопки;
	КонецЕсли;
	
	Элементы.КонсольКода_ГруппаСохраненные.Видимость			= Элементы.КонсольКода_ПоказатьСкрытьСохраненные.Пометка;
	Элементы.СписокАлгоритмовСохранитьТекущийАлгоритм.Видимость	= Элементы.КонсольКода_ПоказатьСкрытьСохраненные.Пометка;
	Элементы.Заменить.Видимость									= Элементы.КонсольКода_ПоказатьСкрытьСохраненные.Пометка;
	
КонецПроцедуры

&НаСервере
Процедура КонсольКода_ДеревоМетаданныхНаСервере()
	
	Если Не КонсольКода_МетаданныеЗагружены Тогда
		ДеревоОбъектовМетаданныхЗаполнить();
		КонсольКода_МетаданныеЗагружены = Истина;
	КонецЕсли;
	
	Элементы.КонсольКода_ДеревоМетаданных.Пометка = НЕ Элементы.КонсольКода_ДеревоМетаданных.Пометка;
	Если Элементы.КонсольКода_ДеревоМетаданных.Пометка Тогда
		Элементы.КонсольКода_ДеревоМетаданных.ЦветФона = WebЦвета.НебесноГолубой;
	Иначе
		Элементы.КонсольКода_ДеревоМетаданных.ЦветФона = ЦветаСтиля.ЦветФонаКнопки;
	КонецЕсли;
	
	Элементы.ДеревоОбъектовМетаданных.Видимость				= Элементы.КонсольКода_ДеревоМетаданных.Пометка;
	Элементы.ДеревоОбъектовМетаданныхПодробности.Видимость	= Элементы.КонсольКода_ДеревоМетаданных.Пометка;
КонецПроцедуры

&НаСервере
Процедура КоллекцииОбъектовМетаданных_НоваяСтрока(Имя, Синоним, Картинка, КартинкаОбъекта, ЭтоКоллекцияОбщие, Таб)
	
	НоваяСтрока = Таб.Добавить();
	НоваяСтрока.Имя               = Имя;
	НоваяСтрока.Синоним           = Синоним;
	НоваяСтрока.Картинка          = Картинка;
	НоваяСтрока.КартинкаОбъекта   = КартинкаОбъекта;
	НоваяСтрока.ЭтоКоллекцияОбщие = ЭтоКоллекцияОбщие;
	
КонецПроцедуры

&НаСервере
Процедура ДеревоОбъектовМетаданныхЗаполнить()
	
	КоллекцииОбъектовМетаданных = Новый ТаблицаЗначений;
	КоллекцииОбъектовМетаданных.Колонки.Добавить("Имя");
	КоллекцииОбъектовМетаданных.Колонки.Добавить("ПолноеИмя");
	КоллекцииОбъектовМетаданных.Колонки.Добавить("Синоним");
	КоллекцииОбъектовМетаданных.Колонки.Добавить("Картинка");
	КоллекцииОбъектовМетаданных.Колонки.Добавить("КартинкаОбъекта");
	КоллекцииОбъектовМетаданных.Колонки.Добавить("ЭтоКоллекцияОбщие");
	
	//КоллекцииОбъектовМетаданных_НоваяСтрока("Подсистемы",                   "Подсистемы",                     35, 36, Истина, КоллекцииОбъектовМетаданных);
	//КоллекцииОбъектовМетаданных_НоваяСтрока("ОбщиеМодули",                  "Общие модули",                   37, 38, Истина, КоллекцииОбъектовМетаданных);
	//КоллекцииОбъектовМетаданных_НоваяСтрока("ПараметрыСеанса",              "Параметры сеанса",               39, 40, Истина, КоллекцииОбъектовМетаданных);
	//КоллекцииОбъектовМетаданных_НоваяСтрока("Роли",                         "Роли",                           41, 42, Истина, КоллекцииОбъектовМетаданных);
	КоллекцииОбъектовМетаданных_НоваяСтрока("ПланыОбмена",                  "Планы обмена",                  БиблиотекаКартинок.ПланОбмена, 			БиблиотекаКартинок.ПланОбмена, 					Истина, КоллекцииОбъектовМетаданных);
	//КоллекцииОбъектовМетаданных_НоваяСтрока("КритерииОтбора",               "Критерии отбора",                45, 46, Истина, КоллекцииОбъектовМетаданных);
	//КоллекцииОбъектовМетаданных_НоваяСтрока("ПодпискиНаСобытия",            "Подписки на события",            47, 48, Истина, КоллекцииОбъектовМетаданных);
	КоллекцииОбъектовМетаданных_НоваяСтрока("РегламентныеЗадания",          "Регламентные задания",          БиблиотекаКартинок.РегламентноеЗадание, 	БиблиотекаКартинок.РегламентноеЗадание, 		Истина, КоллекцииОбъектовМетаданных);
	//КоллекцииОбъектовМетаданных_НоваяСтрока("ФункциональныеОпции",          "Функциональные опции",           51, 52, Истина, КоллекцииОбъектовМетаданных);
	//КоллекцииОбъектовМетаданных_НоваяСтрока("ПараметрыФункциональныхОпций", "Параметры функциональных опций", 53, 54, Истина, КоллекцииОбъектовМетаданных);
	//КоллекцииОбъектовМетаданных_НоваяСтрока("ХранилищаНастроек",            "Хранилища настроек",            БиблиотекаКартинок.ХранилищеНастроек, 		БиблиотекаКартинок.ХранилищеНастроек, 			Истина, КоллекцииОбъектовМетаданных);
	//КоллекцииОбъектовМетаданных_НоваяСтрока("ОбщиеФормы",                   "Общие формы",                    57, 58, Истина, КоллекцииОбъектовМетаданных);
	//КоллекцииОбъектовМетаданных_НоваяСтрока("ОбщиеКоманды",                 "Общие команды",                  59, 60, Истина, КоллекцииОбъектовМетаданных);
	//КоллекцииОбъектовМетаданных_НоваяСтрока("ГруппыКоманд",                 "Группы команд",                  61, 62, Истина, КоллекцииОбъектовМетаданных);
	//КоллекцииОбъектовМетаданных_НоваяСтрока("Интерфейсы",                   "Интерфейсы",                     63, 64, Истина, КоллекцииОбъектовМетаданных);
	//КоллекцииОбъектовМетаданных_НоваяСтрока("ОбщиеМакеты",                  "Общие макеты",                   65, 66, Истина, КоллекцииОбъектовМетаданных);
	//КоллекцииОбъектовМетаданных_НоваяСтрока("ОбщиеКартинки",                "Общие картинки",                 67, 68, Истина, КоллекцииОбъектовМетаданных);
	//КоллекцииОбъектовМетаданных_НоваяСтрока("ПакетыXDTO",                   "XDTO-пакеты",                    69, 70, Истина, КоллекцииОбъектовМетаданных);
	//КоллекцииОбъектовМетаданных_НоваяСтрока("WebСервисы",                   "Web-сервисы",                    71, 72, Истина, КоллекцииОбъектовМетаданных);
	//КоллекцииОбъектовМетаданных_НоваяСтрока("WSСсылки",                     "WS-ссылки",                      73, 74, Истина, КоллекцииОбъектовМетаданных);
	//КоллекцииОбъектовМетаданных_НоваяСтрока("Стили",                        "Стили",                          75, 76, Истина, КоллекцииОбъектовМетаданных);
	//КоллекцииОбъектовМетаданных_НоваяСтрока("Языки",                        "Языки",                          77, 78, Истина, КоллекцииОбъектовМетаданных);
	
	КоллекцииОбъектовМетаданных_НоваяСтрока("Константы",                    "Константы",                     БиблиотекаКартинок.Константа,              БиблиотекаКартинок.Константа,                    Ложь, КоллекцииОбъектовМетаданных);
	КоллекцииОбъектовМетаданных_НоваяСтрока("Справочники",                  "Справочники",                   БиблиотекаКартинок.Справочник,             БиблиотекаКартинок.Справочник,                   Ложь, КоллекцииОбъектовМетаданных);
	КоллекцииОбъектовМетаданных_НоваяСтрока("Документы",                    "Документы",                     БиблиотекаКартинок.Документ,               БиблиотекаКартинок.ДокументОбъект,               Ложь, КоллекцииОбъектовМетаданных);
	КоллекцииОбъектовМетаданных_НоваяСтрока("ЖурналыДокументов",            "Журналы документов",            БиблиотекаКартинок.ЖурналДокументов,       БиблиотекаКартинок.ЖурналДокументов,             Ложь, КоллекцииОбъектовМетаданных);
	КоллекцииОбъектовМетаданных_НоваяСтрока("Перечисления",                 "Перечисления",                  БиблиотекаКартинок.Перечисление,           БиблиотекаКартинок.Перечисление,                 Ложь, КоллекцииОбъектовМетаданных);
	//КоллекцииОбъектовМетаданных_НоваяСтрока("Отчеты",                       "Отчеты",                        БиблиотекаКартинок.Отчет,                  БиблиотекаКартинок.Отчет,                        Ложь, КоллекцииОбъектовМетаданных);
	//КоллекцииОбъектовМетаданных_НоваяСтрока("Обработки",                    "Обработки",                     БиблиотекаКартинок.Обработка,              БиблиотекаКартинок.Обработка,                    Ложь, КоллекцииОбъектовМетаданных);
	КоллекцииОбъектовМетаданных_НоваяСтрока("ПланыВидовХарактеристик",      "Планы видов характеристик",     БиблиотекаКартинок.ПланВидовХарактеристик, БиблиотекаКартинок.ПланВидовХарактеристикОбъект, Ложь, КоллекцииОбъектовМетаданных);
	КоллекцииОбъектовМетаданных_НоваяСтрока("ПланыСчетов",                  "Планы счетов",                  БиблиотекаКартинок.ПланСчетов,             БиблиотекаКартинок.ПланСчетовОбъект,             Ложь, КоллекцииОбъектовМетаданных);
	КоллекцииОбъектовМетаданных_НоваяСтрока("ПланыВидовРасчета",            "Планы видов расчета",     		 БиблиотекаКартинок.ПланВидовРасчета, 		БиблиотекаКартинок.ПланВидовРасчета, 			 Ложь, КоллекцииОбъектовМетаданных);
	КоллекцииОбъектовМетаданных_НоваяСтрока("РегистрыСведений",             "Регистры сведений",             БиблиотекаКартинок.РегистрСведений,        БиблиотекаКартинок.РегистрСведений,              Ложь, КоллекцииОбъектовМетаданных);
	КоллекцииОбъектовМетаданных_НоваяСтрока("РегистрыНакопления",           "Регистры накопления",           БиблиотекаКартинок.РегистрНакопления,      БиблиотекаКартинок.РегистрНакопления,            Ложь, КоллекцииОбъектовМетаданных);
	КоллекцииОбъектовМетаданных_НоваяСтрока("РегистрыБухгалтерии",          "Регистры бухгалтерии",          БиблиотекаКартинок.РегистрБухгалтерии,     БиблиотекаКартинок.РегистрБухгалтерии,           Ложь, КоллекцииОбъектовМетаданных);
	КоллекцииОбъектовМетаданных_НоваяСтрока("РегистрыРасчета",              "Регистры расчета",              БиблиотекаКартинок.РегистрРасчета,         БиблиотекаКартинок.РегистрРасчета,               Ложь, КоллекцииОбъектовМетаданных);
	КоллекцииОбъектовМетаданных_НоваяСтрока("БизнесПроцессы",               "Бизнес-процессы",               БиблиотекаКартинок.БизнесПроцесс,          БиблиотекаКартинок.БизнесПроцессОбъект,          Ложь, КоллекцииОбъектовМетаданных);
	КоллекцииОбъектовМетаданных_НоваяСтрока("Задачи",                       "Задачи",                        БиблиотекаКартинок.Задача,                 БиблиотекаКартинок.ЗадачаОбъект,                 Ложь, КоллекцииОбъектовМетаданных);
	
	// Создание предопределенных элементов.
	ЭлементКонфигурация = НоваяСтрокаДерева(Метаданные.Имя, "", Метаданные.Синоним, 79, ДеревоОбъектовМетаданных);
	ЭлементОбщие        = НоваяСтрокаДерева("Общие",        "", "Общие",             0, ЭлементКонфигурация);
	
	// Заполнение дерева объектов метаданных.
	Для каждого Строка ИЗ КоллекцииОбъектовМетаданных Цикл

		ВыводКоллекцииОбъектовМетаданных(Строка.Имя,
											"",
											Строка.Синоним,
											Строка.Картинка,
											Строка.КартинкаОбъекта,
											?(Строка.ЭтоКоллекцияОбщие, ЭлементОбщие, ЭлементКонфигурация),
											?(Строка.Имя = "Подсистемы", Метаданные.Подсистемы, Неопределено));

	КонецЦикла;
	
	Если ЭлементОбщие.ПолучитьЭлементы().Количество() = 0 Тогда
		ЭлементКонфигурация.ПолучитьЭлементы().Удалить(ЭлементОбщие);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВыводКоллекцииОбъектовМетаданных(Имя, ПолноеИмя, Синоним, Картинка, КартинкаОбъекта, Родитель = Неопределено, Подсистемы = Неопределено, Проверять = Истина)

	НоваяСтрока = НоваяСтрокаДерева(Имя, ПолноеИмя, Синоним, Картинка, Родитель, Подсистемы <> Неопределено И Подсистемы <> Метаданные.Подсистемы);
	
	Если Подсистемы = Неопределено Тогда
		Для каждого ЭлементКоллекцииМетаданных ИЗ Метаданные[Имя] Цикл

			ПолноеИмя = ЭлементКоллекцииМетаданных.ПолноеИмя();
			
			РодительЭлементов = НоваяСтрокаДерева(ЭлементКоллекцииМетаданных.Имя,
									ПолноеИмя,
									ЭлементКоллекцииМетаданных.Синоним,
									КартинкаОбъекта,
									НоваяСтрока,
									Истина,
									Имя);
									
		КонецЦикла;
	КонецЕсли;
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаСервере
Функция НоваяСтрокаДерева(Имя, ПолноеИмя, Синоним, Картинка, Родитель, ЭтоОбъектМетаданных = Ложь, ИмяТипаРодителя = "")
	
	Коллекция = Родитель.ПолучитьЭлементы();
	НоваяСтрока = Коллекция.Добавить();
	НоваяСтрока.Имя                 = Имя;
	НоваяСтрока.Представление       = СтрШаблон("%1 (%2)", Имя, ?(ЗначениеЗаполнено(Синоним), Синоним, Имя));
	НоваяСтрока.Пометка             = 0;
	НоваяСтрока.Картинка            = Картинка;
	НоваяСтрока.ПолноеИмя           = ИмяТипаРодителя + "." + Имя;
	НоваяСтрока.ЭтоОбъектМетаданных = ЭтоОбъектМетаданных;
	
	Возврат НоваяСтрока;
	
КонецФункции

#Область КОНСОЛЬ_КОДА_ЯДРО


&НаСервере 
Процедура ВыполнитьПроизвольныйКодНаСервереПосредник(ТекстВыполнения, Источник = "", Успешно)
	
	Попытка
		
		ВыполнитьПроизвольныйКодНаСервере(ТекстВыполнения);
		
		ТекстСообщения = СтрШаблон("Алгоритм %1успешно выполнен", ?(ЗначениеЗаполнено(Источник), "[" + Источник + "] ", ""));
		
		Сообщить(ТекстСообщения);
		
	Исключение
		
		Сообщить(ОписаниеОшибки());
		Успешно = Ложь;
		
	КонецПопытки;
	
КонецПроцедуры


&НаСервере 
Процедура ВыполнитьПроизвольныйКодНаСервере(ТекстВыполнения)
	
	ВремяНачала = ТекущаяДата();
	
	ОтменаТранзакции	= Элементы.ОтменаТранзакции.Пометка;
	ВестиСтатистику		= Элементы.ФормаСтатистика.Пометка;
	
	Если СтрНайти(нрег(ТекстВыполнения), "текущийобъект") > 0 Тогда
		ТекущийОбъект = Объект.СсылкаНаОбъект.ПолучитьОбъект();
	КонецЕсли;
	
	Если ОтменаТранзакции Тогда
		НачатьТранзакцию();
	КонецЕсли;
	
	Если ВестиСтатистику Тогда
		Сообщить("Начало выполнения: " + ВремяНачала);
	КонецЕсли;
	
	Выполнить ТекстВыполнения;
	
	~Возврат:
	
	ВремяОкончания = ТекущаяДата();
	
	Если ОтменаТранзакции Тогда
		ОтменитьТранзакцию();
		Сообщить("Транзакция отменена");
	КонецЕсли;
	
	Если ВестиСтатистику Тогда
		
		ЗатраченноеВремя = ВремяОкончания - ВремяНачала;
		
		ТекстСообщения = СтрШаблон("Окончание выполнения: %1, время выполнения: %2 минут (%3 секунд)",
		ВремяОкончания,
		Окр(ЗатраченноеВремя / 60, 3),
		ЗатраченноеВремя);
		
		Сообщить(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВызватьФункцию(ВызватьФункцию_ИмяФункции, Переменная1 = Неопределено, Переменная2 = Неопределено, Переменная3 = Неопределено, Переменная4 = Неопределено, Переменная5 = Неопределено, Переменная6 = Неопределено,
													Переменная7 = Неопределено, Переменная8 = Неопределено, Переменная9 = Неопределено)
													
	// Возвращаемое значение
	РезультатФункции = Неопределено;
	
	ФормированиеТекстаВыполнения	= Новый ТекстовыйДокумент;
	ВызватьФункцию_ВсеПараметры		= Новый Структура("Переменная1, Переменная2, Переменная3, Переменная4, Переменная5, Переменная6, Переменная7, Переменная8, Переменная9", 
													   Переменная1, Переменная2, Переменная3, Переменная4, Переменная5, Переменная6, Переменная7, Переменная8, Переменная9);
	
	ВызватьФункцию_ДеревоЗначение		= РеквизитФормыВЗначение("ДеревоАлгоритмов");
	ВызватьФункцию_НайденныйАлгоритм	= ВызватьФункцию_ДеревоЗначение.Строки.НайтиСтроки(Новый Структура("ИмяАлгоритма", ВызватьФункцию_ИмяФункции), Истина);
	
	Если НЕ ЗначениеЗаполнено(ВызватьФункцию_НайденныйАлгоритм) Тогда
		ВызватьИсключение СтрШаблон("Метод [%1] не найден", ВызватьФункцию_ИмяФункции);
	КонецЕсли;
	
	Функция_ГрязныйКодКВыполнению			= ВызватьФункцию_НайденныйАлгоритм[0].Код;
	ВызватьФункцию_ПозицияНачалаПараметров	= СтрНайти(Функция_ГрязныйКодКВыполнению, ВызватьФункцию_ИмяФункции) + СтрДлина(ВызватьФункцию_ИмяФункции) + 1;
	ВызватьФункцию_ПозицияКонцаПараметров	= СтрНайти(Функция_ГрязныйКодКВыполнению, ")");
	
	ВызватьФункцию_ПараметрыФункции = СтрРазделить(Сред(Функция_ГрязныйКодКВыполнению, ВызватьФункцию_ПозицияНачалаПараметров, ВызватьФункцию_ПозицияКонцаПараметров - ВызватьФункцию_ПозицияНачалаПараметров), ",", Ложь);
	
	Для НомерПараметра = 0 По ВызватьФункцию_ПараметрыФункции.Количество() - 1 Цикл
		
		ВызватьФункцию_ПараметрФункции = ВызватьФункцию_ПараметрыФункции[НомерПараметра];
		ВызватьФункцию_СоставПараметра = СтрРазделить(ВызватьФункцию_ПараметрФункции, "=", Ложь);
		
		Если ВызватьФункцию_СоставПараметра.Количество() = 1 Тогда //Без значения по умолчанию
			ФормированиеТекстаВыполнения.ДобавитьСтроку(СтрШаблон("%1 = %2;", ВызватьФункцию_СоставПараметра[0], "Переменная" + (НомерПараметра + 1)));
		ИначеЕсли ВызватьФункцию_СоставПараметра.Количество() = 2 Тогда // Со значением по умолчанию
			Если ЗначениеЗаполнено(ВызватьФункцию_ВсеПараметры["Переменная" + (НомерПараметра + 1)]) Тогда
				ЗначениеПараметра = "Переменная" + (НомерПараметра + 1);
			Иначе
				ЗначениеПараметра = СокрЛП(ВызватьФункцию_СоставПараметра[1]);
			КонецЕсли;
			
			ФормированиеТекстаВыполнения.ДобавитьСтроку(СтрШаблон("%1 = %2;", ВызватьФункцию_СоставПараметра[0], ЗначениеПараметра));
			
		КонецЕсли;
		
	КонецЦикла;
	
	Функция_КонецФункции		= СтрНайти(Функция_ГрязныйКодКВыполнению, "Конец", НаправлениеПоиска.СКонца);
	ВызватьФункцию_ЧистыйКод	= Сред(Функция_ГрязныйКодКВыполнению, ВызватьФункцию_ПозицияКонцаПараметров + 1, Функция_КонецФункции - ВызватьФункцию_ПозицияКонцаПараметров - 1);
	
	ФормированиеТекстаВыполнения.ДобавитьСтроку(ВызватьФункцию_ЧистыйКод);
	
	ТекстВыполнения = ФормированиеТекстаВыполнения.ПолучитьТекст();
	Если СтрНайти(нрег(ТекстВыполнения), "возврат ") > 0 Тогда
		ТекстВыполнения = СтрЗаменить(нрег(ТекстВыполнения), "возврат ", "РезультатФункции = ");
	ИначеЕсли СтрНайти(нрег(ТекстВыполнения), "возврат;") > 0 Тогда
		ТекстВыполнения = СтрЗаменить(нрег(ТекстВыполнения), "возврат;", "Перейти ~Возврат2_0");
	КонецЕсли;
	
	Выполнить ТекстВыполнения;
	
	~Возврат2_0:
	
	Возврат РезультатФункции;
	
КонецФункции

#КонецОбласти 

#КонецОбласти 

#КонецОбласти 

#КонецОбласти

#Область ВИЗУАЛЬНЫЙ_КОНСТРУКТОР

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ


&НаКлиенте
Процедура ВизуальныйКонструкторВыбор(Элемент, Область, СтандартнаяОбработка)
	ВизуальныйКонструкторВыборНаСервере();
КонецПроцедуры

#КонецОбласти 

#Область ОБРАБОТЧИКИ_КОМАНД


&НаКлиенте
Процедура ВизуальныйКонструктор_ВыполнитьПроизвольныйЗапрос(Команда)
	
	ОтмеченныеТаблицы = Новый Массив;
	
	Для Каждого Таблица ИЗ ВизуальныйКонструктор_ДанныеПостроения Цикл
		
		Если ОтмеченныеТаблицы.Найти(Таблица.ИмяТаблицы) = НЕОПРЕДЕЛЕНО Тогда
			ОтмеченныеТаблицы.Добавить(Таблица.ИмяТаблицы);
		КонецЕсли;
		
	КонецЦикла;
	
	ТабличныйДокумент = ВизуальныйКонструктор_ОбработатьЗапрос(ОтмеченныеТаблицы);
	
	ОткрытьФорму("ВнешняяОбработка.УниверсальнаяОбработка.Форма.ФормаРезультатаСоединения", Новый Структура("Результат", ТабличныйДокумент), ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ВизуальныйКонструктор_ВыполнитьЗапрос(Команда)
	
	ДанныеПоложенийТаблиц = ВизуальныйКонструктор_ДанныеПостроения.НайтиСтроки(Новый Структура("ИмяСвойства", "Границы"));
	
	МассивТаблиц = Новый Массив;
	МассивПолей = Новый Массив;
	
	// Получить список таблиц и полей
	Для Каждого ДанныеТаблицы Из ДанныеПоложенийТаблиц Цикл
		
		МассивТаблиц.Добавить(ДанныеТаблицы.ИмяТаблицы);
		
		Граница = ПолучитьГраницыТаблицы(ДанныеТаблицы.Значение);
		
		Для Индекс = Граница.Лево По Граница.Право Цикл
			
			ИмяПоля = СокрЛП(ВизуальныйКонструктор.Область(Граница.Верх, Индекс).Текст);
			ИмяПоля = СтрШаблон("%1.%2", ДанныеТаблицы.ИмяТаблицы, ИмяПоля);
			
			МассивПолей.Добавить(ИмяПоля);
			
		КонецЦикла;
		
	КонецЦикла;
		
	Оповещение = Новый ОписаниеОповещения("ВизуальныйКонструктор_ПослеУтвержденияПолей", ЭтаФорма);
	
	ОткрытьФорму("ВнешняяОбработка.УниверсальнаяОбработка.Форма.ФормаРезультатаСоединения", Новый Структура("Таблицы, Поля", МассивТаблиц, МассивПолей), ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
Процедура ВизуальныйКонструктор_ОтметитьСвязь(Команда)
	
	ТипСвязи = "ВНУТРЕННЕЕ";
	
	ТаблицаСвязи1	= "";
	ТаблицаСвязи2	= "";
	
	ПолеСвязи1		= "";
	ПолеСвязи2		= "";
	
	ПометкаБудет = НЕ Элементы.ВизуальныйКонструктор_ОтметитьСвязь.Пометка;
	
	РежимУстановкиСвязи(ПометкаБудет);
	
	ВизуальныйКонструктор_РежимУстановкиСвязи = Истина;
	
	ВизуальныйКонструктор_КоличествоЭлементовТекущейСвязи = 0;
	
КонецПроцедуры


&НаКлиенте
Процедура ВизуальныйКонструктор_ОтображатьЗапрос(Команда)
	Элементы.ВизуальныйКонструктор_ОтображатьЗапрос.Пометка = НЕ Элементы.ВизуальныйКонструктор_ОтображатьЗапрос.Пометка;
	Элементы.ГруппаСлужебнаяИнформация.Видимость = Элементы.ВизуальныйКонструктор_ОтображатьЗапрос.Пометка;
КонецПроцедуры


&НаКлиенте
Процедура ВизуальныйКонструктор_ВыделитьТаблицу(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаИмениТаблицыДляВизуальногоРедактора", ЭтаФорма);
	
	ИмяТаблицыПредложенное = ПолучитьУникальноеИмя();
	
	ПоказатьВводСтроки(Оповещение, ИмяТаблицыПредложенное, "Введите имя таблицы");
	
КонецПроцедуры


&НаКлиенте
Процедура ВизуальныйКонструктор_Сброс(Команда)
	
	ОчиститьСообщения();
	
	ВизуальныйКонструктор_СбросНаСервере();
	
КонецПроцедуры

#КонецОбласти 

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ


&НаСервере
Процедура РежимУстановкиСвязи(Установить)
	
	ВизуальныйКонструктор_РежимУстановкиСвязи = Установить;
	
	ВизуальныйКонструктор_КоличествоЭлементовТекущейСвязи = 0;
	
	Элементы.ВизуальныйКонструктор_ОтметитьСвязь.Пометка = Установить;
	
	Элементы.ТипСвязи.Видимость = Установить;
	
	Если Установить Тогда
		Элементы.ВизуальныйКонструктор_ОтметитьСвязь.ЦветФона = ЦветаСтиля.ЦветРамки;
	Иначе
		Элементы.ВизуальныйКонструктор_ОтметитьСвязь.ЦветФона = ЦветаСтиля.ЦветФонаКнопки;
	КонецЕсли;
	
	Элементы.ВизуальныйКонструктор.Редактирование = НЕ Установить;
	
КонецПроцедуры


&НаСервере
Процедура ВизуальныйКонструкторВыборНаСервере()
	
	ТекущаяОбласть = Элементы.ВизуальныйКонструктор.ТекущаяОбласть;
	
	Если ВизуальныйКонструктор_РежимУстановкиСвязи И ВизуальныйКонструктор_КоличествоЭлементовТекущейСвязи <= 1 Тогда
		
		// Определяем к какой таблице относится данная ячейка и записываем в данные построения
		ИмяТаблицы = ОпределитьТаблицу(ТекущаяОбласть);
		Если Не ЗначениеЗаполнено(ИмяТаблицы) Тогда
			РежимУстановкиСвязи(Ложь);
			Возврат;
		КонецЕсли;
		
		ТекущаяОбласть.ЦветФона = ЦветаСтиля.ЦветВажного;
		
		Если ВизуальныйКонструктор_КоличествоЭлементовТекущейСвязи = 0 Тогда
			ТаблицаСвязи1	= ИмяТаблицы;
			ПолеСвязи1		= ТекущаяОбласть.Текст
		Иначе
			ТаблицаСвязи2	= ИмяТаблицы;
			ПолеСвязи2		= ТекущаяОбласть.Текст;
		КонецЕсли;
		
		Если ВизуальныйКонструктор_КоличествоЭлементовТекущейСвязи = 1 Тогда
			
			НоваяСвязь = ВизуальныйКонструктор_ДанныеСвязей.Добавить();
			
			НоваяСвязь.Таблица1			= ТаблицаСвязи1;
			НоваяСвязь.Таблица2			= ТаблицаСвязи2;
			НоваяСвязь.ТипСоединения	= ТипСвязи;
			НоваяСвязь.ПолеСвязи1		= ПолеСвязи1;
			НоваяСвязь.ПолеСвязи2		= ПолеСвязи2;
			
			РежимУстановкиСвязи(Ложь);
			Сообщить("Соединение записано");
			
		Иначе
			ВизуальныйКонструктор_КоличествоЭлементовТекущейСвязи = ВизуальныйКонструктор_КоличествоЭлементовТекущейСвязи + 1;
		КонецЕсли;
		
	ИначеЕсли НЕ ВизуальныйКонструктор_РежимУстановкиСвязи Тогда
		
		РежимУстановкиСвязи(Ложь);
		
	ИначеЕсли ВизуальныйКонструктор_КоличествоЭлементовТекущейСвязи = 2 Тогда
		
		РежимУстановкиСвязи(Ложь);
		// Фиксация связи
		
	КонецЕсли;
		
КонецПроцедуры


&НаСервере
Функция ОпределитьТаблицу(ТекущаяОбласть)
	
	ДанныеПоложенийТаблиц = ВизуальныйКонструктор_ДанныеПостроения.НайтиСтроки(Новый Структура("ИмяСвойства", "Границы"));
	
	ТекущаяВерх = ТекущаяОбласть.Верх;
	ТекущаяЛево = ТекущаяОбласть.Лево;
	
	Для Каждого ДанныеГраниц Из ДанныеПоложенийТаблиц Цикл
		
		Граница = ПолучитьГраницыТаблицы(ДанныеГраниц.Значение);
		
		Если ТекущаяВерх = Граница.Верх И (ТекущаяЛево >= Граница.Лево И ТекущаяЛево <= Граница.Право) Тогда
			Возврат ДанныеГраниц.ИмяТаблицы;
		КонецЕсли;
		
	КонецЦикла;
	
	Сообщить("В указаном диапазоне не найдено выделенных таблиц.");
	
	Возврат "";
	
КонецФункции


&НаСервере
Функция ПолучитьГраницыТаблицы(ДанныеГраниц)
	
	ГраницыТаблицы = СтрРазделить(ДанныеГраниц, ",", Ложь);
	
	Верх	= Число(ГраницыТаблицы[0]);
	Лево	= Число(ГраницыТаблицы[1]);
	Низ		= Число(ГраницыТаблицы[2]);
	Право	= Число(ГраницыТаблицы[3]);
	
	Возврат Новый Структура("Верх, Лево, Низ, Право", Верх, Лево, Низ, Право);
	
КонецФункции


&НаКлиенте
Функция ПолучитьУникальноеИмя()
	
	МассивЗначенийГенератора = Новый Массив;
	Генератор = Новый ГенераторСлучайныхЧисел;
	
	Для Индекс = 1 По 10 Цикл
		МассивЗначенийГенератора.Добавить(Генератор.СлучайноеЧисло(0,9));
	КонецЦикла;
	
	СгенерированноеЗначение = "Таблица_" + СтрСоединить(МассивЗначенийГенератора);
	
	Возврат СгенерированноеЗначение;
	
КонецФункции


&НаСервере
Процедура ВизуальныйКонструктор_СбросНаСервере()
	
	ВизуальныйКонструктор.Очистить();
	ВизуальныйКонструктор_ДанныеПостроения.Очистить();
	ВизуальныйКонструктор_ДанныеСвязей.Очистить();
	
	Сообщить("Данные сброшены");
	
КонецПроцедуры


&НаСервере
Функция ВизуальныйКонструктор_ОбработатьЗапрос(СписокТаблиц)
	
	СтруктураТаблиц = Новый Структура;
	
	Для Каждого Таблица Из СписокТаблиц Цикл
		
		ДанныеТаблицы = ВизуальныйКонструктор_ДанныеПостроения.НайтиСтроки(Новый Структура("ИмяТаблицы, ИмяСвойства", Таблица, "Границы"))[0];
		
		Граница = ПолучитьГраницыТаблицы(ДанныеТаблицы.Значение);
		
		Максимум = 0;
		// Определение максимальной длины полей
		Для ИндексВертикаль = Граница.Верх + 1 По Граница.Низ Цикл
			Для ИндексГоризонталь = Граница.Лево По Граница.Право Цикл
				ДлинаПоля = СтрДлина(СокрЛП(ВизуальныйКонструктор.Область(ИндексВертикаль, ИндексГоризонталь).Текст));
				Если ДлинаПоля > Максимум Тогда
					Максимум = ДлинаПоля;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		ОписаниеСтроки = ОписаниеТипаСтрока(Максимум);
		
		НоваяТаблица = Новый ТаблицаЗначений;
		
		Для Индекс = Граница.Лево По Граница.Право Цикл
			
			ИмяПоля = СокрЛП(ВизуальныйКонструктор.Область(Граница.Верх, Индекс).Текст);
			
			НоваяТаблица.Колонки.Добавить(ИмяПоля, ОписаниеСтроки) 
			
		КонецЦикла;
		
		Для ИндексВертикаль = Граница.Верх + 1 По Граница.Низ Цикл
			
			НоваяСтрокаТаблицы = НоваяТаблица.Добавить();
			
			Для ИндексГоризонталь = Граница.Лево По Граница.Право Цикл
				
				ИмяПоля = СокрЛП(ВизуальныйКонструктор.Область(Граница.Верх, ИндексГоризонталь).Текст);
				
				ЗначениеПоля = СокрЛП(ВизуальныйКонструктор.Область(ИндексВертикаль, ИндексГоризонталь).Текст);
				
				НоваяСтрокаТаблицы[ИмяПоля] = ЗначениеПоля;
				
			КонецЦикла;
			
		КонецЦикла;
		
		СтруктураТаблиц.Вставить(Таблица, НоваяТаблица);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Для Каждого ТаблицаСтруктуры Из СтруктураТаблиц Цикл
		
		Запрос.УстановитьПараметр(ТаблицаСтруктуры.Ключ, ТаблицаСтруктуры.Значение);
		
	КонецЦикла;
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных=Новый ОписаниеИсточникаДанных(Результат);       
	Построитель.Вывести(ТабличныйДокумент);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти 

#Область ОБРАБОТЧИКИ_ОПОВЕЩЕНИЙ


&НаКлиенте
Процедура ПослеВводаИмениТаблицыДляВизуальногоРедактора(ИмяТаблицы, ДополнительныеПараметры) Экспорт
	
	ТаблицаУжеСуществует = ВизуальныйКонструктор_ДанныеПостроения.НайтиСтроки(Новый Структура("ИмяТаблицы", ИмяТаблицы)).Количество() > 0;
	
	Если Не ЗначениеЗаполнено(ИмяТаблицы) Тогда
		Сообщить("Имя таблицы обязательно!");
		Возврат;
	КонецЕсли;
	
	Если ТаблицаУжеСуществует Тогда
		Сообщить("Таблица с таким именем уже существует, попробуйте еще раз.");
		Возврат;
	КонецЕсли;
	
	ТекущаяОбласть = Элементы.ВизуальныйКонструктор.ТекущаяОбласть;
	
	ДанныеОбласти = Новый Массив;
	ДанныеОбласти.Добавить(ТекущаяОбласть.Верх);
	ДанныеОбласти.Добавить(ТекущаяОбласть.Лево);
	ДанныеОбласти.Добавить(ТекущаяОбласть.Низ);
	ДанныеОбласти.Добавить(ТекущаяОбласть.Право);
	
	НоваяСтрокаДанных =		ВизуальныйКонструктор_ДанныеПостроения.Добавить();
	НоваяСтрокаДанных.ИмяТаблицы = ИмяТаблицы;
	НоваяСтрокаДанных.ИмяСвойства = "Границы"; // верх, лево, низ, право (против часовой)
	НоваяСтрокаДанных.Значение = СтрСоединить(ДанныеОбласти, ",");
	
	ТекущаяОбласть.ГраницаСверху = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Двойная, 1);
	ТекущаяОбласть.ГраницаСлева = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Двойная, 1);
	ТекущаяОбласть.ГраницаСнизу = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Двойная, 1);
	ТекущаяОбласть.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Двойная, 1);
	
КонецПроцедуры


&НаКлиенте
Процедура ВизуальныйКонструктор_ПослеУтвержденияПолей(Результат, ДополнительныеПараметры) Экспорт
	
	ОчиститьСообщения();
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Сообщить("Необходимо выбрать данные для вывода.");
		Возврат;
	КонецЕсли;
	
	//В результате будут содержаться отмеченные к выводу таблицы и их поля
	МассивТекстов			= Новый Массив;
	Разделитель				= "; //";
	
	ОтмеченныеТаблицы	= Результат.ОтмеченныеТаблицы;
	ОтмеченныеПоля		= Результат.ОтмеченныеПоля;
	ВсеПоля				= Результат.ВсеПоля;
	
	Для Каждого ИнтересующаяТаблица Из ОтмеченныеТаблицы Цикл
		
		ТекстЗапросаПодготовка	= Новый ТекстовыйДокумент;
		
		ТекстЗапросаПодготовка.ДобавитьСтроку("");
		ТекстЗапросаПодготовка.ДобавитьСтроку("ВЫБРАТЬ");
		
		КоличествоПолей = 0;
		Для Каждого Поле Из ВсеПоля Цикл
			
			Если СтрНачинаетсяС(Поле, ИнтересующаяТаблица + ".") Тогда
				КоличествоПолей = КоличествоПолей + 1;
			КонецЕсли;
			
		КонецЦикла;
		
		ИндексТекущегоПоля = 1;
		Для Каждого Поле Из ВсеПоля Цикл
			
			Если СтрНачинаетсяС(Поле, ИнтересующаяТаблица + ".") Тогда
				
				ТекстДобавления = Поле + ?(ИндексТекущегоПоля < КоличествоПолей, ",", "");
				ТекстЗапросаПодготовка.ДобавитьСтроку(ТекстДобавления);
				
				ИндексТекущегоПоля = ИндексТекущегоПоля + 1;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ТекстЗапросаПодготовка.ДобавитьСтроку("ПОМЕСТИТЬ " + ИнтересующаяТаблица);
		ТекстЗапросаПодготовка.ДобавитьСтроку(СтрШаблон("ИЗ &%1 КАК %1", ИнтересующаяТаблица));
		
		МассивТекстов.Добавить(ТекстЗапросаПодготовка.ПолучитьТекст());
		
	КонецЦикла;
	
	ТекстЗапросаПодготовка	= Новый ТекстовыйДокумент;
	
	ТекстЗапросаПодготовка.ДобавитьСтроку("");
	ТекстЗапросаПодготовка.ДобавитьСтроку("ВЫБРАТЬ");
	
	ИндексТекущегоПоля = 1;
	Для Каждого ИнтересующаяТаблица Из ОтмеченныеТаблицы Цикл
		
		Для Каждого Поле Из ОтмеченныеПоля Цикл
			
			Если СтрНачинаетсяС(Поле, ИнтересующаяТаблица + ".") Тогда
				
				ТекстДобавления = Поле + ?(ИндексТекущегоПоля < ОтмеченныеПоля.Количество(), ",", "");
				ТекстЗапросаПодготовка.ДобавитьСтроку(ТекстДобавления);
				
				ИндексТекущегоПоля = ИндексТекущегоПоля + 1;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ОсновнаяТаблица = ОтмеченныеТаблицы[0];
	
	ТекстЗапросаПодготовка.ДобавитьСтроку(СтрШаблон("ИЗ %1 КАК %1", ОсновнаяТаблица));
	
	Для Каждого ИнтересующаяТаблица Из ОтмеченныеТаблицы Цикл
		
		СписокСвязей	= ВизуальныйКонструктор_ДанныеСвязей.НайтиСтроки(Новый Структура("Таблица1", ИнтересующаяТаблица));
		
		ПерваяСвязь = Истина;
		
		Для Каждого Связь Из СписокСвязей Цикл
			
			Если ОтмеченныеТаблицы.Найти(Связь.Таблица2) <> Неопределено Тогда
				
				Если ПерваяСвязь Тогда
					
					ТекстЗапросаПодготовка.ДобавитьСтроку(СтрШаблон("%1 СОЕДИНЕНИЕ %2 КАК %2", Связь.ТипСоединения, Связь.Таблица2));
					ТекстЗапросаПодготовка.ДобавитьСтроку(СтрШаблон("ПО %1.%2 = %3.%4", Связь.Таблица1, Связь.ПолеСвязи1, Связь.Таблица2, Связь.ПолеСвязи2));
					
					ПерваяСвязь = Ложь;
					
				Иначе
					
					ТекстЗапросаПодготовка.ДобавитьСтроку(СтрШаблон("И %1.%2 = %3.%4", Связь.Таблица1, Связь.ПолеСвязи1, Связь.Таблица2, Связь.ПолеСвязи2));
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЦикла;
	
	МассивТекстов.Добавить(ТекстЗапросаПодготовка.ПолучитьТекст());
	
	ТекстЗапроса = СтрСоединить(МассивТекстов, Разделитель);
	
	ТабличныйДокумент = ВизуальныйКонструктор_ОбработатьЗапрос(ОтмеченныеТаблицы);
	
	ОткрытьФорму("ВнешняяОбработка.УниверсальнаяОбработка.Форма.ФормаРезультатаСоединения", Новый Структура("Результат", ТабличныйДокумент), ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти 

#Область ОБЩИЕ_СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаСервере 
Функция ОписаниеТипаСтрока(ДлинаСтроки) Экспорт

	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));

	КвалификаторСтроки = Новый КвалификаторыСтроки(ДлинаСтроки, ДопустимаяДлина.Переменная);

	Возврат Новый ОписаниеТипов(Массив, , КвалификаторСтроки);

КонецФункции

Функция СформироватьПодсказку()
	
	ФормированиеПодсказки = Новый ТекстовыйДокумент;
	ФормированиеПодсказки.ДобавитьСтроку("ПЕРЕМЕННЫЕ: ");
	ФормированиеПодсказки.ДобавитьСтроку("ТекущийОбъект													- Объект вкладки ""Редактирование документов""");
	ФормированиеПодсказки.ДобавитьСтроку("ВизуальныйКонструктор									- Название табличного документа вкладки ""Соединения таблиц""");
	ФормированиеПодсказки.ДобавитьСтроку("-------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
	ФормированиеПодсказки.ДобавитьСтроку("ВСТРОЕННЫЕ МЕТОДЫ:");
	ФормированиеПодсказки.ДобавитьСтроку("СН(СтрокаНавигационнойСсылки)						- Получить ссылку по навигации");
	ФормированиеПодсказки.ДобавитьСтроку("НС(Ссылка)														- Получить навигационную ссылку");
	ФормированиеПодсказки.ДобавитьСтроку("ПолнаяКопияОбъекта(ОбъектИсточник)				- Полное копирование объеата, включая ТЧ");
	ФормированиеПодсказки.ДобавитьСтроку("СвойствоСуществует(Владелец, ИмяСвойства)	- Тоже что и БСП ЕстьРеквизитИлиСвойствоОбъекта");
	ФормированиеПодсказки.ДобавитьСтроку("СброситьПуть()													- Для обработки встроенной в справочник ""Дополнительные отчеты и обработки""");
	ФормированиеПодсказки.ДобавитьСтроку("Шаблон(""Текст %Переменная"", Значение )			- Подстановка шаблона и вывод через сообщить.");
	ФормированиеПодсказки.ДобавитьСтроку("ВызватьФункцию(ИмяФункции, Параметр1, N)	- Вызывает функцию из списка алгоритмов, функция должна быть в обычном для конфигуратора виде. Без экспорта.");
	ФормированиеПодсказки.ДобавитьСтроку("Перейти ~Возврат;											- Для возврата из алгоритма.");
	ФормированиеПодсказки.ДобавитьСтроку("РегулярноеВыражениеНайтиВсе(СтрокаИсточник, Паттерн, Global=Истина) - Поиск по регулярному выражению");
	ФормированиеПодсказки.ДобавитьСтроку("Пинг(IPАдрес)					-	 Есть ли ответ от сервера");
	ФормированиеПодсказки.ДобавитьСтроку("-------------------------------------------------------------------------------------------------------------------------------------------------------------------------");
	ФормированиеПодсказки.ДобавитьСтроку("БЫСТРЫЕ КУСКИ КОДА:");
	ФормированиеПодсказки.ДобавитьСтроку("Построитель = Новый ПостроительОтчета;
										 |Построитель.ИсточникДанных=Новый ОписаниеИсточникаДанных(Таблица);     
										 |Построитель.Вывести(ВизуальныйКонструктор); - Вывод таблицы в соседнюю вкладку ""Соединение таблиц""");
	
	Подсказка			= ФормированиеПодсказки.ПолучитьТекст();
	
КонецФункции


&НаСервере
Функция СвойствоСуществует(Родитель, ПроверяемоеСвойство)
	
	Исходник = Новый УникальныйИдентификатор;
	
	СтруктураПроверки = Новый Структура(ПроверяемоеСвойство, Исходник);
	
	ЗаполнитьЗначенияСвойств(СтруктураПроверки, Родитель);
	
	Возврат НЕ СтруктураПроверки[ПроверяемоеСвойство] = Исходник;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура СообщитьПользователю(
		Знач ТекстСообщенияПользователю,
		Знач КлючДанных = Неопределено,
		Знач Поле = "",
		Знач ПутьКДанным = "",
		Отказ = Ложь) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.Поле = Поле;
	
	ЭтоОбъект = Ложь;
	
	Если ЭтоОбъект Тогда
		Сообщение.УстановитьДанные(КлючДанных);
	Иначе
		Сообщение.КлючДанных = КлючДанных;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПутьКДанным) Тогда
		Сообщение.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
		
	Сообщение.Сообщить();
	
	Отказ = Истина;
	
КонецПроцедуры

#Область РЕДАКТОР_ОБЪЕКТОВ

&НаСервере
Процедура ЗаполнитьФормуСервер(СозданиеНового = Ложь, СозданиеГруппы = Ложь)
	
	ОчиститьФорму();
	
	Если НЕ СозданиеНового И Не ЗначениеЗаполнено(Объект.СсылкаНаОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеОбъекта = Объект.СсылкаНаОбъект.Метаданные();
	ТипЗначения = ТипЗнч(Объект.СсылкаНаОбъект);
	
	Если СозданиеНового Тогда
		Если ЗначениеЗаполнено(Объект.СсылкаНаОбъект) Тогда
			Объект.СсылкаНаОбъект = Новый (ТипЗначения);
		КонецЕсли;
		
		Если Документы.ТипВсеСсылки().СодержитТип(ТипЗначения) Тогда
			РедактируемыйОбъект = Документы[МетаданныеОбъекта.имя].СоздатьДокумент();
		ИначеЕсли ПланыСчетов.ТипВсеСсылки().СодержитТип(ТипЗначения) Тогда	
			РедактируемыйОбъект = ПланыСчетов[МетаданныеОбъекта.имя].СоздатьСчет();
		ИначеЕсли ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(ТипЗначения) Тогда	
			РедактируемыйОбъект = ПланыВидовРасчета[МетаданныеОбъекта.имя].СоздатьВидРасчета();
		ИначеЕсли БизнесПроцессы.ТипВсеСсылки().СодержитТип(ТипЗначения) Тогда
			РедактируемыйОбъект = БизнесПроцессы[МетаданныеОбъекта.имя].СоздатьБизнесПроцесс();
		ИначеЕсли Задачи.ТипВсеСсылки().СодержитТип(ТипЗначения) Тогда
			РедактируемыйОбъект = Задачи[МетаданныеОбъекта.имя].СоздатьЗадачу();
		ИначеЕсли ПланыОбмена.ТипВсеСсылки().СодержитТип(ТипЗначения) Тогда
			РедактируемыйОбъект = ПланыОбмена[МетаданныеОбъекта.имя].СоздатьУзел();
		Иначе //это справочник или ПВХ
			Менеджер = ?(Справочники.ТипВсеСсылки().СодержитТип(ТипЗначения), Справочники[МетаданныеОбъекта.имя], ПланыВидовХарактеристик[МетаданныеОбъекта.имя]);
			РедактируемыйОбъект = ?(СозданиеГруппы, Менеджер.СоздатьГруппу(), Менеджер.СоздатьЭлемент());
		КонецЕсли;
		
	Иначе
		РедактируемыйОбъект = Объект.СсылкаНаОбъект.ПолучитьОбъект();
		GUID = Объект.СсылкаНаОбъект.УникальныйИдентификатор();
	КонецЕсли;
	
	ТипЗначенияОбъекта = Новый Массив;
	ТипЗначенияОбъекта.Добавить(ТипЗнч(РедактируемыйОбъект));
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы(
			"РедактируемыйОбъектФормы",
			Новый ОписаниеТипов(ТипЗначенияОбъекта)));
		
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ЗначениеВРеквизитФормы(РедактируемыйОбъект, "РедактируемыйОбъектФормы");
	
	// Убрал разделение на справочники и документы, вывожу все стандартные реквизиты объектов
	Для Каждого РеквизитОбъекта из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
		
		ДобавитьПолеФормы(
		"Реквизит",
		РеквизитОбъекта.Имя,
		Элементы.СтраницаРеквизиты,
		Тип("ПолеФормы"),
		ВидПоляФормы.ПолеВвода);
		
	КонецЦикла;
	
	Для Каждого РеквизитОбъекта Из МетаданныеОбъекта.Реквизиты Цикл
		ДобавитьПолеФормы(
			"Реквизит",
			РеквизитОбъекта.Имя,
			Элементы.СтраницаРеквизиты,
			Тип("ПолеФормы"),
			ВидПоляФормы.ПолеВвода);
	КонецЦикла;
		
	Для Каждого ТабличнаяЧасть Из МетаданныеОбъекта.ТабличныеЧасти Цикл
		СтраницаПанели = ДобавитьПолеФормы(
						"СтраницаТабличнаяЧасть",
						ТабличнаяЧасть.Имя,
						Элементы.ГруппаТабличныеЧасти,
						Тип("ГруппаФормы"));
		СтраницаПанели.Заголовок = ТабличнаяЧасть.Представление();
		
		ЭлементТЧ = ДобавитьПолеФормы(
						"ТабличнаяЧасть",
						ТабличнаяЧасть.Имя,
						СтраницаПанели,
						Тип("ТаблицаФормы"));
			
		Для Каждого Реквизит Из ТабличнаяЧасть.Реквизиты Цикл
			ДобавитьПолеФормы(
				"РеквизитТЧ",
				ТабличнаяЧасть.Имя + "." + Реквизит.Имя,
				ЭлементТЧ,
				Тип("ПолеФормы"),
				ВидПоляФормы.ПолеВвода);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьПолеФормы(Префикс, Путь, Родитель, ТипПоля, ВидПоля = Неопределено)
	
	Если Префикс = "Реквизит" И НЕ ЭтаФорма["РедактируемыйОбъектФормы"].Свойство(Путь) Тогда
		Возврат Неопределено;
	ИначеЕсли Префикс = "РеквизитТЧ" Тогда
		ПутьКДанным			= "РедактируемыйОбъектФормы." + Путь;
		ПутьКДаннымРодителя	= Родитель.ПутьКДанным;
		ИмяКолонки	= СтрЗаменить(ПутьКДанным, ПутьКДаннымРодителя + ".", "");
		ИмяРодителя	= СтрЗаменить(ПутьКДаннымРодителя, "РедактируемыйОбъектФормы.", "");
		Если ЭтаФорма["РедактируемыйОбъектФормы"][ИмяРодителя].Выгрузить().Колонки.Найти(ИмяКолонки) = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	ПолеФормы = Элементы.Добавить(
					Префикс + СтрЗаменить(Путь, ".", ""),
					ТипПоля,
					Родитель);
						
	Если ВидПоля <> Неопределено Тогда
		ПолеФормы.Вид = ВидПоля;
	КонецЕсли;
	
	Если ТипПоля = Тип("ПолеФормы") Или ТипПоля = Тип("ТаблицаФормы")Тогда
		ПолеФормы.ПутьКДанным = "РедактируемыйОбъектФормы." + Путь;
	КонецЕсли;
	
	Возврат ПолеФормы;
	
КонецФункции

&НаСервере
Процедура ОчиститьФорму()
	
	ЭлементыДляУдаления = Новый Массив;
	
	ДобавитьЭлементыГруппыВМассив(ЭлементыДляУдаления, Элементы.СтраницаРеквизиты);
	ДобавитьЭлементыГруппыВМассив(ЭлементыДляУдаления, Элементы.ГруппаТабличныеЧасти);
	
	Для Каждого Элемент Из ЭлементыДляУдаления Цикл
		Элементы.Удалить(Элемент);
	КонецЦикла;
	
	РеквизитыФормы = ЭтаФорма.ПолучитьРеквизиты();
	
	РеквизитыДляУдаления = Новый Массив;
	
	Для Каждого Реквизит Из РеквизитыФормы Цикл
		Если Реквизит.Имя = "РедактируемыйОбъектФормы" Тогда
			РеквизитыДляУдаления.Добавить(Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Если РеквизитыДляУдаления.Количество() > 0 Тогда
		ИзменитьРеквизиты(, РеквизитыДляУдаления);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементыГруппыВМассив(МассивЭлементов, ГруппаФормы)
	
	Для Каждого Элемент Из ГруппаФормы.ПодчиненныеЭлементы Цикл
		МассивЭлементов.Добавить(Элемент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьОбъектСервер()
	
	ЕстьРеквизит = Ложь;
	
	РеквизитыФормы = ЭтаФорма.ПолучитьРеквизиты();
	Для Каждого Реквизит Из РеквизитыФормы Цикл
		Если Реквизит.Имя = "РедактируемыйОбъектФормы" Тогда
			ЕстьРеквизит = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьРеквизит Тогда
		СообщитьПользователю("Не выбран объект",, "Объект.СсылкаНаОбъект");
		Возврат;
	КонецЕсли;
	
	РедактируемыйОбъект = РеквизитФормыВЗначение("РедактируемыйОбъектФормы");
	
	Если Объект.ОбменДанными Тогда
		РедактируемыйОбъект.ОбменДанными.Загрузка = Истина;
	КонецЕсли;
	
	РедактируемыйОбъект.Записать();
	
	Объект.СсылкаНаОбъект = РедактируемыйОбъект.Ссылка;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьГруппы(Ссылка)
	
	Если Ссылка = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТипЗначенияСсылки = ТипЗнч(Ссылка);
	МетаданныеСсылки = Ссылка.Метаданные();
	
	Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗначенияСсылки) Тогда
		Если МетаданныеСсылки.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда
			Возврат Истина;
		КонецЕсли;
	ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(ТипЗначенияСсылки) Тогда
		Возврат МетаданныеСсылки.Иерархический;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Хранимые файлы

&НаКлиенте
Процедура ХранимыеФайлы_Обновить(Команда)
	ХранимыеФайлы_ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ХранимыеФайлы_ОбновитьНаСервере()
	
	ХранимыеОбработки.Очистить();
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	Для Каждого МетаданныеМакета Из ОбъектОбработки.Метаданные().Макеты Цикл
		Макет = ОбъектОбработки.ПолучитьМакет(МетаданныеМакета.Имя);
		Если ТипЗнч(Макет) = Тип("ДвоичныеДанные") Тогда
			НовыйЭлемент = ХранимыеОбработки.Добавить();
			НовыйЭлемент.Представление = МетаданныеМакета.Имя;
			НовыйЭлемент.Значение = Макет;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ХранимыеОбработки_ЗапускВнешнегоИнструмента(ДвоичныеДанные, ТипИнструмента)
	
	АдресВХД			= ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	Попытка 
		ОбъектОписанияЗащиты = Новый ОписаниеЗащитыОтОпасныхДействий;
		ОбъектОписанияЗащиты.ПредупреждатьОбОпасныхДействиях = Ложь;
		
		Если ТипИнструмента = "ВнешнийОтчет" Тогда
			АдресОтчета	= ВнешниеОтчеты.Подключить(АдресВХД,, Ложь, ОбъектОписанияЗащиты);
			Инструмент	= ВнешниеОтчеты.Создать(АдресОтчета, Ложь);
		Иначе
			АдресОбработки	= ВнешниеОбработки.Подключить(АдресВХД,, Ложь, ОбъектОписанияЗащиты);
			Инструмент		= ВнешниеОбработки.Создать(АдресОбработки, Ложь);
		КонецЕсли;
		
		СтруктураВозврата = Новый Структура("ИмяОбработки, ОсновнаяФорма", Инструмент.Метаданные().Имя, Инструмент.Метаданные().ОсновнаяФорма.Имя);
		Возврат СтруктураВозврата;
	Исключение
		Сообщить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура ХранимыеОбработкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ХранимыеОбработки.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИнформацияОФайле = РазобратьИнформациюПоХранимомуФайлу(ТекущиеДанные.Представление);
	
	Если ИнформацияОФайле.ЭтоВнешняяОбработка Тогда
		ДанныеОбработки		= ХранимыеОбработки_ЗапускВнешнегоИнструмента(ТекущиеДанные.Значение, ИнформацияОФайле.ТипВнешнейОбработки);
		ИмяФормыОбработки	= СтрШаблон("%1.%2.Форма.%3", ИнформацияОФайле.ТипВнешнейОбработки, ДанныеОбработки.ИмяОбработки, ДанныеОбработки.ОсновнаяФорма);
	
		ОткрытьФорму(ИмяФормыОбработки);
	Иначе
		ПараметрыФайла = Новый Структура("ИмяФайла, ТипФайла, ДД", ИнформацияОФайле.ИмяФайла, ИнформацияОФайле.ТипФайла, ТекущиеДанные.Значение);
		НачатьПолучениеКаталогаВременныхФайлов(Новый ОписаниеОповещения("ПослеПолученияКаталогаВременныхФайлов", ЭтаФорма, ПараметрыФайла));//ПолучитьИмяВременногоФайла(ТипФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция РазобратьИнформациюПоХранимомуФайлу(Представление)
	
	СоставноеИмя = СтрРазделить(Представление, "_", Ложь);
	
	ТипФайла = нрег(СоставноеИмя[0]);
	ИмяФайла = СоставноеИмя[1];
	
	ЭтоВнешняяОбработка	= Истина;
	ТипВнешнейОбработки		= "";
	
	Если ТипФайла = "отчет" Тогда
		ТипФайла = "erf";
		ТипВнешнейОбработки = "ВнешнийОтчет";
	ИначеЕсли ТипФайла = "обработка" Тогда
		ТипФайла = "epf";
		ТипВнешнейОбработки = "ВнешняяОбработка";
	Иначе // Нужно просто открыть файл, тип файла содержится в конце
		ТипФайла = СоставноеИмя[СоставноеИмя.ВГраница()];
		ЭтоВнешняяОбработка = Ложь;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("ИмяФайла, ТипФайла, ЭтоВнешняяОбработка, ТипВнешнейОбработки");
	СтруктураВозврата.ИмяФайла = ИмяФайла;
	СтруктураВозврата.ТипФайла = ТипФайла;
	СтруктураВозврата.ЭтоВнешняяОбработка = ЭтоВнешняяОбработка;
	СтруктураВозврата.ТипВнешнейОбработки = ТипВнешнейОбработки;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура ПослеПолученияКаталогаВременныхФайлов(Результат, ДополнительныеПараметры) Экспорт
	
	ИмяФайла = СтрШаблон("%1%2.%3", Результат, ДополнительныеПараметры.ИмяФайла, ДополнительныеПараметры.ТипФайла);
	ДополнительныеПараметры.ДД.Записать(ИмяФайла);
	НачатьЗапускПриложения(Новый ОписаниеОповещения, ИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ХранимыеФайлы_Выгрузить(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораРасположенияФайла", ЭтаФорма);
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбора.Заголовок = "Выберите папку сохранения";
	ДиалогВыбора.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораРасположенияФайла(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Сообщить("Операция отменена. Путь назначения не выбран.");
		Возврат;
	КонецЕсли;
	
	Для Каждого ВыделеннаяСтрока Из Элементы.ХранимыеОбработки.ВыделенныеСтроки Цикл
		
		ОбрабатываемаяСтрока	= ХранимыеОбработки[ВыделеннаяСтрока];
		ИнформацияОФайле		= РазобратьИнформациюПоХранимомуФайлу(ОбрабатываемаяСтрока.Представление);
		
		ИмяФайла = СтрШаблон("%1\%2.%3", Результат[0], ИнформацияОФайле.ИмяФайла, ИнформацияОФайле.ТипФайла);
		ОбрабатываемаяСтрока.Значение.Записать(ИмяФайла);
		
		Сообщить(СтрШаблон("Записано в %1", ИмяФайла));
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОбъектовМетаданныхПриАктивизацииСтроки(Элемент)
	
	а=0;
	ТекущиеДанные = Элементы.ДеревоОбъектовМетаданных.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И ТекущиеДанные.ЭтоОбъектМетаданных Тогда
		ОбновитьДанныеОбъектаМетаданных(ТекущиеДанные.ПолноеИмя);
	КонецЕсли;
	
	//ДозаполняемыеДанные = Новый Структура("Измерения, Ресурсы, Реквизиты", БиблиотекаКартинок.Измерение, БиблиотекаКартинок.Ресурс, БиблиотекаКартинок.Реквизит);
	
	//Для Каждого ЗаполняемыеДанные Из ДозаполняемыеДанные Цикл
			//							
			//	Попытка                                             
			//		
			//		Для Каждого РеквизитОбъекта Из ЭлементКоллекцииМетаданных[ЗаполняемыеДанные.Ключ] Цикл
			//			
			//			ИмяТипа = Метаданные.НайтиПоТипу(РеквизитОбъекта.Тип.Типы()[0]).ПолноеИмя();
			//			
			//			Реквизит = НоваяСтрокаДерева(РеквизитОбъекта.Имя,
			//				СтрШаблон("%1.%2", ПолноеИмя, РеквизитОбъекта.Имя),
			//				СтрШаблон("Синоним: %1 | Тип: %2", РеквизитОбъекта.Синоним, ИмяТипа),
			//				ЗаполняемыеДанные.Значение,
			//				РодительЭлементов,
			//				Истина);
			//			
			//		КонецЦикла;
			//			
			//	Исключение
			//	КонецПопытки;
			//
			//КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеОбъектаМетаданных(ИмяОбъекта)
	
	//ДеревоЗначениеПодробности = РеквизитФормыВЗначение("ДеревоОбъектовМетаданныхПодробности");
	//ДеревоЗначениеПодробности.Строки.Очистить();
	ДеревоОбъектовМетаданныхПодробности.ПолучитьЭлементы().Очистить();
	
	ИмяОбъектаРазделенное = СтрРазделить(ИмяОбъекта, ".", Ложь);
	
	РодительОбъектаМД	= ИмяОбъектаРазделенное[0];
	ИмяОбъектаМД		= ИмяОбъектаРазделенное[1];
	
	НайденныйОбъектМД	= Метаданные[РодительОбъектаМД][ИмяОбъектаМД];
	
	ДозаполняемыеДанные = Новый Структура("Измерения, Ресурсы, Реквизиты, ТабличныеЧасти", 
										БиблиотекаКартинок.Измерение, БиблиотекаКартинок.Ресурс, БиблиотекаКартинок.Реквизит, БиблиотекаКартинок.ВложеннаяТаблица);
										
	Для Каждого ЗаполняемыеДанные Из ДозаполняемыеДанные Цикл
		
		Если СвойствоСуществует(НайденныйОбъектМД, ЗаполняемыеДанные.Ключ) Тогда
			
			РодительЭлементов = НоваяСтрокаДерева(ЗаполняемыеДанные.Ключ, ЗаполняемыеДанные.Ключ, ЗаполняемыеДанные.Ключ, ЗаполняемыеДанные.Значение, ДеревоОбъектовМетаданныхПодробности, Ложь);
			
			Для Каждого РеквизитОбъекта Из НайденныйОбъектМД[ЗаполняемыеДанные.Ключ] Цикл
				
				Если ЗаполняемыеДанные.Ключ = "ТабличныеЧасти" Тогда
					ИмяТипа = "ТабличнаяЧасть";
				Иначе
					ИмяТипа = ПолучитьИмяТипаОбъектаМД(РеквизитОбъекта);
				КонецЕсли;
				
				Реквизит = НоваяСтрокаДерева(РеквизитОбъекта.Имя,
				РеквизитОбъекта.Имя,//СтрШаблон("%1.%2", ПолноеИмя, РеквизитОбъекта.Имя),
				СтрШаблон("Синоним: %1 | Тип: %2", РеквизитОбъекта.Синоним, ИмяТипа),
				ЗаполняемыеДанные.Значение,
				РодительЭлементов,
				Истина);
				
				Если ЗаполняемыеДанные.Ключ = "ТабличныеЧасти" Тогда
					Для Каждого ЭлементТЧ Из РеквизитОбъекта.Реквизиты Цикл
						
						ИмяТипа = ПолучитьИмяТипаОбъектаМД(ЭлементТЧ);
						
						НоваяСтрокаДерева(ЭлементТЧ.Имя,
						ЭлементТЧ.Имя,//СтрШаблон("%1.%2", ПолноеИмя, РеквизитОбъекта.Имя),
						СтрШаблон("Синоним: %1 | Тип: %2", ЭлементТЧ.Синоним, ИмяТипа),
						БиблиотекаКартинок.Реквизит,
						Реквизит,
						Истина);
					КонецЦикла;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
		
	
	
	//ДеревоОбъектовМетаданных.НайтиПоИдентификатору(0
	//
	//ОписаниеТипа = Тип(ИмяОбъекта)
	//Новый ОписаниеТипов(ИмяОбъекта)
	
	//МетаданныеТекущихДанных = Метаданные[ИмяОбъектаРазделенное[0]][ИмяОбъектаРазделенное[1]];
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяТипаОбъектаМД(РеквизитМД)
	
	НайденныеМетаданныеПоТипу = Метаданные.НайтиПоТипу(РеквизитМД.Тип.Типы()[0]);
	Если НайденныеМетаданныеПоТипу = Неопределено Тогда
		ИмяТипа = РеквизитМД.Тип;
	Иначе
		ИмяТипа = НайденныеМетаданныеПоТипу.ПолноеИмя();
	КонецЕсли;
	
	Возврат ИмяТипа;
	
КонецФункции

&НаКлиенте
Процедура КодДляОтладки(Команда)
	КодДляОтладкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура КодДляОтладкиНаСервере()
	
	//Задание = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Новый Структура("Наименование", "Очистить архив исходящих сообщений Rabbit MQ"));
	//
	//Если Не ЗначениеЗаполнено(Задание) Тогда
	//	Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные.РегламентныеЗадания.ОчиститьАрхивИсходящихСообщенийRabbitMQ);
	//Иначе
	//	Задание = Задание[0];
	//	Если Задание.Использование Тогда
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Расписание = Новый РасписаниеРегламентногоЗадания;
	//Расписание.ПериодНедель					= 1;	// Для ежедневного недели должны быть равны 1
	//Расписание.ПериодПовтораВТечениеДня		= 0;  // Сек.
	//Расписание.ПериодПовтораДней			= 1;	// Каждый день - значение 1
	//Расписание.ВремяНачала					= НачалоДня(ТекущаяДата()+1);
	//Расписание.ИнтервалЗавершения			= 3620;
	//
	//Задание.Расписание = Расписание;
	//Задание.Использование = Истина;
	//Задание.Записать();
	
	//СсылкаНаПользователя = СН("e1cib/data/Справочник.Пользователи?ref=b70ec465162843f811ea0448b5b23301");
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"Выбрать ВерсияОбъекта из РегистрСведений.ВерсииОбъектов где Объект = &Ссылка и номерВерсии = 2";
	//Запрос.УстановитьПараметр("Ссылка", СсылкаНаПользователя);
	//
	//Результат = Запрос.Выполнить().Выбрать();
	//
	//Если Результат.Следующий() Тогда
	//	ДД = Результат.ВерсияОбъекта.Получить();
	//	Сообщить(Результат.ВерсияОбъекта);
	//Иначе
	//	ВызватьИсключение "Запись версии не найдена";
	//КонецЕсли;
	//
	//ЧтениеXML = Новый ЧтениеFastInfoSet;
	//ЧтениеXML.УстановитьДвоичныеДанные(ДД);
	//ЗаписьXML = Новый ЗаписьXML;
	//ЗаписьXML.УстановитьСтроку();
	//Пока ЧтениеXML.Прочитать() Цикл
	//	ЗаписьXML.ЗаписатьТекущий(ЧтениеXML);
	//КонецЦикла;
	//СтрокаXML = ЗаписьXML.Закрыть();
	//
	//ТД = Новый ТекстовыйДокумент;
	//ТД.УстановитьТекст(СтрокаXML);
	//ТД.Записать("C:\testJDTO.xml", КодировкаТекста.UTF8);
	
	СтрокаДанных = "AgFTS2/0iI3BTqDV67a9oKcNzVl7bxzVFXcCaUIiK9AU0bRQxptCCOy1Z+7cmbnj\r\nblIkogqkhiKgov/ReYKLs0b25oHSSHGCiIC0CRMkIgRxltDyR4W6cbzESfz4CJ39\r\nBv0GnW9Azzl3d2d2/cg2/FN7vd6Ze+5533N+Z/abbUP085+7q6dK+0plwU2pG27I\r\nnEi4TMSBy1wj9Jlv+65lhFYQy6g8vPOUiW/wKr1WKpfST9OVdBX+7qbL6WLrbNpM\r\n77YupMutj+HTNfi7k86ni+ktXGt9XDqNe1GYF8S24fKISSPwmLCjmLmmZzPLs11b\r\n+o60bZLjdiXqIOxKugAsl0HMYut9YHsnbcDnldaZEvF9xavVoukqSCmVyjrJMmDX\r\nl2kDaJdwJyg6D1egatrs3VNWFp0e3lnYzWH3Z0DdaJ2n3Wt2tWlxE5GbZR1+Dfjl\r\n8EvyuVrRy2RF6fdtH5DzvkJ3pU2wZSVdLiw857hcd0zbEULA7Y4yxno8vkUO6R1w\r\n7xnkQtpe1DAmrfPgnEaB9sjxiWp14p2p497zkxMztdHpY8QctQfmp5WX6Vq9egJd\r\nBxlnIKzov2a6dK8AW0bkeHrImWXqPjOMUDDflR7TdakLGXqmbgpyEM9N+RwNQJ3R\r\nHGUIhHwZ3QPGLcH1ByDm4uizRfs3zIn0UroA783WLDCENG3NEut5oFgsMsjJ+oh6\r\nQw+6zFGeN9Pbxe1fwk3ILWDRE01gQuStc8Cg0T4YF3uDT8mITh3dxIp6O7J9Whd2\r\nk6AF0LaB29JbA3LLWeD/Iu9B4zCYgwbmtrEnP4HrW8Ro4b51TcDiBQgxRAFyeRVu\r\nzqJfCrxejeLC1Uszv5maDKPpwq1XpqMwiieqUXjYq3kve0ej0gaH5Wp6o/WROpb5\r\nkZCOwW2u68yMXMmEiHQ4EqbBgsA3QicKA+E6qmbgQcw5qxeW6tM/VSX730NDW4ZO\r\n/mvryZmJZ96u1d4dHxs7ceLE6AlzdGr6rTEQYYz94chvXwvejo56bKI6U/OqQZRV\r\nnj48FRw7GlVrv/P/FAW10TxlwI13sbopV56anX2g9t670Yu/GHBDVtkKzktGoFz5\r\n0rAd5tixyyLHMRjUeBvMFJ4fhkI4jp9Vdh2OJqPaxFT1iDf9TrI19iZnQLkHwKdR\r\n8jDXucl0i+nm64YY1yW8ssq2l48d9aPpZIeu68I0uJSuBXdfmZqpRWGypTZ9DBhs\r\nh7A20tuts8mIFfmx7pqSxVHkQPGJJPM8V2dh6AVuEAnTte2s8lgh47BHtLenzWTH\r\n0ejNXI6TXofMaaDBcHoubHK6epziOMmPtM5PVrHur1Jllee3DSx/Ez6OA44vKpiM\r\nxMKx7EgaLHI9jl4Kme+5WKIt3bKlE0lMmifXqWMXConQSAw6W8vUH++omqKlX1Bh\r\nwdtwkRA0aNDOJqwvY8rsovZxE2jgBEPM4tCwuIAgRZ5EbVzmO3HA9CAQjuf5vvSC\r\nrPIQ9iEwopEuJCOSh7YZcJfpwheMyxAyzeEcsIthxWCT5woI38/puIMzQM6Nfrck\r\nT/bdIcf1Z/djcLNBJP3bi/mq6+P0QvrP2pWrn37EMGwr9AX424WNYCYALE86DA6t\r\n0GPMW1ui06+QbEzNeQr9GkaCB4HFrZhZAhAUMZK6DTAKHOIAngptI0ZN6rRpWZVB\r\nCEtTdYBkRG//sHXeOj9ZZe/G/TH5a/o5pMUZVUgRdKCDITZI1LpQ1vJl+HwZTxfm\r\nMTBrlDVu4zuih9ExYPs+1mNNiDIhF5D4EZX8BY0TEdzRqPYvES35VlEjA/zQ+kvr\r\n7CjPKub99PPLQ0MPlCuD9hLt5NHJ6szBUqHyHpejRgB4amxmZnIsmKrWvKA2UY2n\r\nSop2HAp1D/3mlTrfde9NJS2dQ3PB6I6pdztY9WDp/y5ApUM7NU15eklBclSaKsXt\r\nMbVWz6Omgd/GsRMdLMA0sFihGMTxDVi5Bu22Dr9X0n8S+0GYwKav28RE3jqXd2xc\r\nG8vXrhLwPZfeLNyrg5uvkb++SK92buOCugnm58Rj61NXwOErhL0WDuVxAOr8dpcy\r\nATedI5sXoWCuIwP7F2xH1DQHqi6jGYXV69Q7Pkgbh3qjDNLypS61GumUq2C6KJrX\r\nbZgaYLTFdPVgydANHSLSNyUdLGH6lIpO2IDr/yiObyAO5qR7CqNIdNOCkq3vDlwP\r\nWAMO7cwqT+S+JuywhL2PJqQV6osjumdDTwoC5vmexyxuB0zopsusyNBdPYyt2AcY\r\n8mj6dYc35NoqnU8YpZJhAiUYnfNqnqZWBhKXiBRNvENX7UOUbDFgXswqu4kLdo42\r\nLEhGPA96uuVGzAulAOTpCiZlHLJYl9xG4GnHVOp7cYZKygvIqjGUVfatf2r7e+X+\r\nDcg6yPsGGUvIZhdcLlAcAXxd0lHEHPlungpIW4ucPVgLuCN5GBqTwehV6Ll7e31T\r\nLPyN7dhR8+WClwnIJFgRkOgR9bEH3WzVR02TY5g6oH6pf126Au3+iurwDRCDPXYW\r\nrM0nLAzg7fQbLDB1tHMt7ec4Rxd7NdDtAaXVtFZQubEjq4ykCTFYgo0JsFZeXCwq\r\nhmRGX0Q3n1VpIgK8uaVvV1401z5rWAGr5tSjhvYg2uaybxN/dx2JPndAqybsbCoZ\r\naAYRztOGCx028N4X1TrG/CuVX2BHf8yHMOZq6Ct4pTdbk0c3nmicTQxATLVCz5RW\r\nVCvtcTwYNdbnwnuldYLR2t+/iSw7r0A0SFDb76Byw+lVUEE90oK/OtqaB7dOpQHP\r\n/4dEQcmXbMsnmr3EewXyTJlbJ3i00DkrjxZMX7OE0T6rshfjr+xHb+9dM061gTpW\r\nridUJmMpo5LaB7rBgMc3nmveOPJaVimn12kCwV3z6txAeMmO9CahAao5RyaqoT91\r\n8uuOkbkDux6DIzS0ttopTpTduGz2TA24d5WEKCRZRyv7FU3nccorkkLF68sOJWW+\r\n3YSbBCy+Ta/VMaRY0W/S6oqquAfWjwOx63Fg6xzGxqTAE9f0O6ola85r56kdRX4V\r\n8xkkP/jS4Tcd5xusx4WnSjDST52oPDXYs6TCME0pqg7LOXQDjGkeZJ1hchh0fJ/B\r\ntCKYa+KYZkjTsy09DLiJwudIMMq5COON7do6jENMxsLC8SbA4dTpG073ULNRPbKp\r\nUiNduWRggVxngfxzo40cV9Bl29O/k8bYPLnr0nzZcXnj4Uzbg0QHIM9UF2uQH64R\r\n8lWj2WI3njRSJLuA9hJ6lp6MNrM/7yG4dovOxYcdvDL04uMveDVvcuqtV6N4tFBg\r\n/9ZWrj2hZP/AE7duP80gNGubyDp5SamlnhCqR33YgHb31o90pZ5pe1XKFZjSU97b\r\n3R50mZi0zzyUgx2Z9mP0z+52Vi/R4Aw032slbV+m/TIZid0QAmlK5kWRZMLhAEEc\r\n22O+FZqhwwMzjMJMeyoZcW0BQQ0k82MeqGcRUkLgQ2lFoWlIK4jtTHu6sTvT9oNM\r\n7ZlkiFsi0w40fqKipD3beCT743NDs+AzrZxpDCwahb+xtmWa3tFXM3L9RGzzyA8F\r\nM00PUjN2bCaDwGSR9CzfdPzQj2zSz7Z837I9ySJhWh39LGNj/T7hNmr32A/RznA8\r\nbni2YL6IDSa4azJX6JxFli+F7ejCDSzlPUPqbqDDEbF8o+s9vol2pova/eyHaBcK\r\nHnBfAooMbBeALQRYuqHPONctB0+oFXDSzpKWyQPHYo4fhB3t+KaxNZT3nrgP/RAl\r\nb/JwvANQB5nzS5Vtau5IdvUCpgwWCFpAjHisc8Els13A1+1HjRLSPHJNwNUQGc/s\r\n9KJ1h/TkoeK3PUi64WOK5PVTwztLx73JY1FpXOv9lqgMKzjk4kLf90q4FEwdq9am\r\n33thKiSK4s7hnacJiuczdTaMhbA7h2IBKWLAOUR3n3ar/TK1zSuERevtskjTRy8k\r\n6EOcyfai0QcGf/iPrWaDZ/lYwHb3z4aYsCLZPziKzTSrG1Z307BqdrJ77XdqmeYk\r\nb/QEap3v3XrCNbBqFCtNQnw0OL/jjacy7VfJg125lUw7mGmH8ET8+nuaiHIIAyeh\r\ngGLRT9fhstF+YEstfB/49S5cftfNvMuET261Q0Op+332Xw==";
	а=XMLЗначение(Тип("ХранилищеЗначения"), СтрокаДанных);

	//ЧтениеJSON.Прочитать();
	//ЧтениеJSON.Закрыть();
	//Преобразовать
	ф=0;

	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПреобразоватьJSONВСтруктуруДанных(СтрокаJSON) Экспорт
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	
	Попытка
		Возврат ПрочитатьJSON(Чтение);
	Исключение
		ТекстОшибки = НСтр("ru='Нарушена структура JSON строки'") + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;	
	КонецПопытки;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПреобразоватьСтруктуруДанныхВJSON(СтруктураДанных) Экспорт

	Запись = Новый ЗаписьJSON();
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, СтруктураДанных);
	Попытка
		Возврат Запись.Закрыть();
	Исключение
		ТекстОшибки = НСтр("ru='В структуре данных недопустимый тип для записи в JSON строку'") + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;	
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура ПанельСпискаКодов(Команда)
	
	Если Не ЗначениеЗаполнено(ТекущийИдентификаторКода) Тогда
		ТекущийИдентификаторКода = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	Если ОкнаКонсолиКода.Количество() = 0 Тогда
		НоваяСтрокаСписка = ОкнаКонсолиКода.Добавить();
		НоваяСтрокаСписка.Идентификатор = ТекущийИдентификаторКода;
	КонецЕсли;
	
	// Актуализация кода в хранилище
	ИнтересующаяСтрока = ОкнаКонсолиКода.НайтиСтроки(Новый Структура("Идентификатор", ТекущийИдентификаторКода))[0];
	ИнтересующаяСтрока.ТекстКода = ПроизвольныйКод.ПолучитьТекст();
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораТекущегоКода", ЭтаФорма);
	
	ОкнаКонсолиКодаСер = ОкнаКонсолиКодаВСтрокуВнутр();
	
	ПараметрыОткрытия = Новый Структура("ВходящаяТаблица, ТекущийИдентификатор", ОкнаКонсолиКодаСер, ТекущийИдентификаторКода);
	
	ОткрытьФорму("ВнешняяОбработка.УниверсальнаяОбработка.Форма.СписокКодов", ПараметрыОткрытия, , , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ОкнаКонсолиКодаВСтрокуВнутр()
	Возврат ЗначениеВСтрокуВнутр(ОкнаКонсолиКода.Выгрузить());
КонецФункции

&НаСервере
Процедура ОкнаКонсолиКодаИзСтрокиВнутр(СтрокаВнутр)
	ОкнаКонсолиКода.Загрузить(ЗначениеИзСтрокиВнутр(СтрокаВнутр));
КонецПроцедуры
	
&НаКлиенте
Процедура ПослеВыбораТекущегоКода(ПараметрыЗакрытия, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ПараметрыЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийИдентификаторКода = ПараметрыЗакрытия.Идентификатор;
	ОкнаКонсолиКодаИзСтрокиВнутр(ПараметрыЗакрытия.ВесьСписок);
	ПроизвольныйКод.УстановитьТекст(ПараметрыЗакрытия.ТекущийКод);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьТекстДляКонфигуратора(Команда)
	ВыделенныеТекст = Элементы.ПроизвольныйКод.ВыделенныйТекст;
	Если Не ЗначениеЗаполнено(ВыделенныеТекст) Тогда
		ВыделенныеТекст = ПроизвольныйКод.ПолучитьТекст();
	КонецЕсли;
	
	Результат = ТекстДляКонфигуратора(ВыделенныеТекст);
	ПоказатьРезультатВОкне(Результат);
	
КонецПроцедуры

&НаСервере    
Процедура ВывестиСтроку(СтрокаПоказа)
	КонсольКодаРезультат.Очистить();
	КонсольКодаРезультат.УстановитьТекст(СтрокаПоказа);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРезультатВОкне(СтрокаПоказа)
	
	ОткрытьФорму("ВнешняяОбработка.УниверсальнаяОбработка.Форма.ФормаВыводаСтроки", Новый Структура("Результат", СтрокаПоказа),,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция РегулярноеВыражениеНайтиВсе(СтрокаИсточник, Выражение, ОтключатьЗащиту = Ложь) Экспорт
	
	Если ОтключатьЗащиту Тогда
		ОписаниеБезопасности = Новый ОписаниеЗащитыОтОпасныхДействий;
		ОписаниеБезопасности.ПредупреждатьОбОпасныхДействиях = Ложь;
		ЗаписьЖурналаРегистрации("Отключение предупреждения об опасных действиях.", УровеньЖурналаРегистрации.Предупреждение, , , 
																		"Регулярное выражение. " + ПараметрыСеанса.ПользовательОС);
	КонецЕсли;
	
	RegExp = Новый COMОбъект("VBScript.RegExp");
	RegExp.Global = Истина;
	RegExp.Pattern = Выражение;
	
	Finded = RegExp.Execute(СтрокаИсточник);
	
	ГлавныйМассив = Новый Массив;
	
	
	Для Индекс = 0 По Finded.Count - 1 Цикл
		
		Массив = Новый Массив;
		
		ТекущаяГруппа = Finded.item(Индекс).SubMatches;
		Для ИндексГруппы = 0 По ТекущаяГруппа.Count - 1 Цикл
			Значение = ТекущаяГруппа.item(ИндексГруппы);
			Если НЕ Значение = Неопределено Тогда
				Массив.Добавить(Значение);
			КонецЕсли;
		КонецЦикла;
		
		ГлавныйМассив.Добавить(Массив);
	КонецЦикла;
	
	Возврат ГлавныйМассив;
	
КонецФункции

Функция РегулярноеВыражениеТест(СтрокаИсточник, Выражение) Экспорт
	
	ОписаниеБезопасности = Новый ОписаниеЗащитыОтОпасныхДействий;
	ОписаниеБезопасности.ПредупреждатьОбОпасныхДействиях = Ложь;
	
	RegExp = Новый COMОбъект("VBScript.RegExp");
	RegExp.Global = Истина;
	RegExp.Pattern = Выражение;
	
	Результат = RegExp.Test(СтрокаИсточник);
	
	ОписаниеБезопасности.ПредупреждатьОбОпасныхДействиях = Истина;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция Пинг(Адрес) Экспорт
	
	objShell = Новый COMОбъект("WScript.Shell") ;
	objScriptExec = objShell.Exec("ping.exe -n 1 " + Адрес);
	strPingResults = НРег(objScriptExec.StdOut.ReadAll());
	
	Успешно = СтрНайти(strPingResults, "ttl") >0;
	
	Возврат Успешно
	
КонецФункции

&НаКлиенте
Процедура ДеревоОбъектовМетаданныхПодробностиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоОбъектовМетаданныхПодробности.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПроизвольныйКод.ВыделенныйТекст = ТекущиеДанные.Имя;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОбъектовМетаданныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоОбъектовМетаданных.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПроизвольныйКод.ВыделенныйТекст = ТекущиеДанные.Имя;
	
КонецПроцедуры

Функция ОтправитьСообщениеВТГ(ТекстСообщения) Экспорт
	
	Ресурс = СтрШаблон("bot%1/sendMessage?chat_id=%2&text=%3", telegram_api_key, telegram_chat_id, ТекстСообщения);
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	
	АдресСервера	= "api.telegram.org";
	ЗащитаСвязи		= Новый ЗащищенноеСоединениеOpenSSL();
	ТаймАут			= 30;
	
	Попытка
		
		Соединение	= Новый HTTPСоединение(АдресСервера, , , , , ТаймАут, ЗащитаСвязи);
		
		Запрос		= Новый HTTPЗапрос(Ресурс);
		
		Ответ = Соединение.Получить(Запрос);
		Если Не Ответ.КодСостояния = 200 Тогда
			Шаблон = 
			"При отправке сообщения в Telegram для %1 сервер вернул код:%1
			|Подробный ответ:%2";
			ОписаниеРезультата = СтрШаблон(Шаблон, Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку());
			
			Сообщить(ОписаниеРезультата);
		КонецЕсли;
		
	Исключение
		
		Шаблон("При отправке сообщения в ТГ, произошла ошибка: %1", ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции

#КонецОбласти 

#КонецОбласти 