
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = "Замер времени выполнения: " + Параметры.ИмяЗапроса;
	
	ПараметрыПередачи = ПолучитьИзВременногоХранилища(Параметры.АдресХранилища);
	
	Объект.Запросы.Загрузить(ПараметрыПередачи.Запросы);	
	Объект.Параметры.Загрузить(ПараметрыПередачи.Параметры);
		
	ИдентификаторТекущегоЗапроса = ПараметрыПередачи.ИдентификаторТекущегоЗапроса;
	
	Попытка
		
		// Синтаксический контроль запроса
		Для каждого СтрокаЗапроса Из Объект.Запросы Цикл		
			Если СтрокаЗапроса.Идентификатор = ИдентификаторТекущегоЗапроса Тогда			
				СхемаЗапроса = Новый СхемаЗапроса;
				СхемаЗапроса.УстановитьТекстЗапроса(СтрокаЗапроса.Текст);
				ТекстЗапроса = СтрокаЗапроса.Текст;
			КонецЕсли;		
		КонецЦикла; 	
	
	Исключение
		
		Отказ = Истина;
		Сообщить(ОписаниеОшибки());
		
	КонецПопытки; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗамер(Команда)
	ВыполнитьЗамерНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЗаписей(Команда)
	
	ПоказыватьКоличествоЗаписейВТ = Не ПоказыватьКоличествоЗаписейВТ;
	
	Элементы.ФормаКоличествоЗаписей.Пометка 	 = ПоказыватьКоличествоЗаписейВТ;
	Элементы.РезультатЗамераКоличество.Видимость = ПоказыватьКоличествоЗаписейВТ;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗамерНаСервере()	
	
	РезультатЗамера.Очистить();
	
	Запрос = ИнициализацияЗапроса();
	
	// Через схему запроса 
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	Сч = 1;
	Для каждого ЗапросПакета Из СхемаЗапроса.ПакетЗапросов Цикл
		
		ЗапросВыборка = ТипЗнч(ЗапросПакета) = Тип("ЗапросВыбораСхемыЗапроса");
		
		Если ЗапросВыборка Тогда
			ТекстПодзапроса = ЗапросПакета.ПолучитьТекстЗапроса();
		Иначе // Запрос уничтожения ВТ	
		    ТекстПодзапроса = "УНИЧТОЖИТЬ " + ЗапросПакета.ИмяТаблицы;
		КонецЕсли;		
		
		Запрос.Текст = ТекстПодзапроса;
		
		НачалоВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		Результат = Запрос.Выполнить();
		
		КонецВыполнения  = ТекущаяУниверсальнаяДатаВМиллисекундах() ;
		
		ВремяВыполнения = (КонецВыполнения - НачалоВыполнения) / 1000;

		НоваяСтрока = РезультатЗамера.Добавить();
		НоваяСтрока.Подзапрос 	 = ТекстПодзапроса;
		НоваяСтрока.Время        = ВремяВыполнения;
		НоваяСтрока.НомерЗапроса = Сч;
		Если ЗапросВыборка Тогда
			НоваяСтрока.ИмяВТ = ЗапросПакета.ТаблицаДляПомещения;		
		КонецЕсли; 
		
		Если ПоказыватьКоличествоЗаписейВТ И ЗапросВыборка Тогда
			Если ЗапросПакета.ТаблицаДляПомещения <> "" Тогда
				НоваяСтрока.Количество = КоличествоЗаписейВоВременнойТаблице(Запрос, ЗапросПакета.ТаблицаДляПомещения);
			Иначе
				НоваяСтрока.Количество = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой).Количество();
			КонецЕсли; 			
		КонецЕсли;
		
		Сч = Сч + 1;
	
	КонецЦикла; 
	
	ОбщееВремя = РезультатЗамера.Итог("Время");
	
КонецПроцедуры

&НаСервере
Функция ИнициализацияЗапроса()

	ПараметрыЗапроса = Объект.Параметры.НайтиСтроки(Новый Структура("ИдентификаторЗапроса", ИдентификаторТекущегоЗапроса));
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	РеквизитФормыВЗначение("Объект").ЗагрузкаПараметровВЗапрос(Запрос, ПараметрыЗапроса);
	
	Возврат Запрос;

КонецФункции // ИнициализацияЗапроса()

&НаСервереБезКонтекста
Функция КоличествоЗаписейВоВременнойТаблице(Запрос, ИмяВременнойТаблицы)

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Записей
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВременнаяТаблица", ИмяВременнойТаблицы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Записей;	

КонецФункции // КоличествоЗаписейВТаблице()




