#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Активна = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПользователя(Команда)

	СписокПользователей = AI_ДоступКАгентамКлиентСервер.ПолучитьПользователейИнформационнойБазы();
	Если СписокПользователей.Количество() = 0 Тогда
		Сообщить("В информационной базе нет доступных для выбора пользователей.");
		Возврат;
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения(
		"ДобавитьПользователяЗавершение",
		ЭтотОбъект);
	ПоказатьВыборИзСписка(
		Оповещение,
		СписокПользователей,
		Элементы.Участники);

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПользователяЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт

	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДанныеПользователя = ВыбранноеЗначение.Значение;
	Для Каждого Участник Из Объект.Участники Цикл
		Если Участник.ИдентификаторПользователя = ДанныеПользователя.ИдентификаторПользователя Тогда
			Сообщить("Этот пользователь уже входит в группу.");
			Возврат;
		КонецЕсли;
	КонецЦикла;

	Участник = Объект.Участники.Добавить();
	Участник.ИдентификаторПользователя = ДанныеПользователя.ИдентификаторПользователя;
	Участник.Имя = ДанныеПользователя.Имя;
	Участник.ПолноеИмя = ДанныеПользователя.ПолноеИмя;

КонецПроцедуры
