
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивПодсказок = Новый Массив;
	МассивПодсказок.Добавить("СН(СтрокаНавигации);Получение ссылки из навигационной ссылки");
	
	Для Каждого Подсказка Из МассивПодсказок Цикл
		
		ПодсказкаОписание = СтрРазделить(Подсказка, ";", Ложь);
		
		НоваяСтрока = ДоступныеМетоды.Добавить();
		НоваяСтрока.Описание = ПодсказкаОписание[0];
		НоваяСтрока.Назначение = ПодсказкаОписание[1];
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	
	ОчиститьСообщения();
	
	Если НЕ ЭтаФорма.ПроверитьЗаполнение() ИЛИ Не ЗначениеЗаполнено(КодВыполнения.ПолучитьТекст()) Тогда
		Сообщить("Заполните все поля.");
		Возврат;
	КонецЕсли;
	
	АдресЗначения = ПрименитьНаСервере();
	
	Если Не АдресЗначения = Неопределено Тогда
		Закрыть(Новый Структура("ИмяПеременной, Адрес", ИмяПеременной, АдресЗначения));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПрименитьНаСервере()
	
	Результат = Неопределено;
	
	Попытка
		Выполнить КодВыполнения.ПолучитьТекст();
		Если Результат = Неопределено Тогда
			Сообщить("Ошибка выполнения. Необходимо заполнить переменную [Результат].");
			Возврат Неопределено;
		КонецЕсли;
		АдресХранения = ПоместитьВоВременноеХранилище(Результат);
		Возврат АдресХранения;
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция СН(СтрокаНавигации)
    
    ПерваяТочка = Найти(СтрокаНавигации, "e1cib/data/");
    ВтораяТочка = Найти(СтрокаНавигации, "?ref=");
    
    ПредставлениеТипа   = Сред(СтрокаНавигации, ПерваяТочка + 11, ВтораяТочка - ПерваяТочка - 11);
    ШаблонЗначения = ЗначениеВСтрокуВнутр(ПредопределенноеЗначение(ПредставлениеТипа + ".ПустаяСсылка"));
    ЗначениеСсылки = СтрЗаменить(ШаблонЗначения, "00000000000000000000000000000000", Сред(СтрокаНавигации, ВтораяТочка + 5));
    Ссылка = ЗначениеИзСтрокиВнутр(ЗначениеСсылки);
	
	Возврат Ссылка;
	
КонецФункции


