
#Область ПрограммныйИнтерфейс

Функция НайтиПоИдентификаторуЛогики(ИдентификаторДляЛогики) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	AI_Агенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.AI_Агенты КАК AI_Агенты
		|ГДЕ
		|	AI_Агенты.ИдентификаторДляЛогики = &ИдентификаторДляЛогики";
	
	Запрос.УстановитьПараметр("ИдентификаторДляЛогики", ИдентификаторДляЛогики);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		НайденнаяМодель = Результат.Ссылка;
	Иначе
		ВызватьИсключение СтрШаблон("Не удалось найти агента по идентификатору логики [%1]. Продолжение невозможно.", ИдентификаторДляЛогики);
	КонецЕсли;
	
	Возврат НайденнаяМодель;
	
КонецФункции

#КонецОбласти