
#Область ОбработчикиСобытий

//Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
//	ПроверитьИдентификаторЛогикиНаДубли(Отказ);
//КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Процедура ПроверитьИдентификаторЛогикиНаДубли(Отказ)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//		"ВЫБРАТЬ
//		|	AI_Агенты.Наименование КАК Наименование
//		|ИЗ
//		|	Справочник.AI_Агенты КАК AI_Агенты
//		|ГДЕ
//		|	НЕ AI_Агенты.Ссылка = &Ссылка
//		|	И AI_Агенты.ИдентификаторДляЛогики = &ИдентификаторДляЛогики";
//	Запрос.УстановитьПараметр("ИдентификаторДляЛогики", ИдентификаторДляЛогики);
//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
//	
//	Результат = Запрос.Выполнить().Выбрать();
//	
//	Если Результат.Следующий() Тогда
//		Сообщить(СтрШаблон("Данный идентификатор используется в элементе [%1]. Продолжение не возможно.", ИдентификаторДляЛогики));
//		Отказ = Истина;
//	КонецЕсли;
//	
//КонецПроцедуры

#КонецОбласти