
//---------------------------------------------------------------------------------
//										TO DO
//---------------------------------------------------------------------------------
// 1. Прятайте API ключи в безопасное хранилище
// 
// 2. Проследить что бы логирование выполнялось по всей цепочке, необходимо для отслеживания лимитов
// 3. Предусмотреть лимиты для модели и провайдера
// 4. Предусмотреть отправку pdf и файлов для участия в контексте
// 7. Создать подсистему и поставку для нее
// 8. Создать возможность цепочки вызова агентов
// 9. Запись ответов в регистр ответов для псевдосинхронной обработки ?
// 10. ПРОВЕРИТЬ УДАЛЕНИЕ Старых векторов из Qdrant

//---------------------------------------------------------------------------------
//								ОПИСАНИЕ ОБЪЕКТОВ
//---------------------------------------------------------------------------------
//
//	1. Общие модули:
//		1. AI_YandexAI - Самописный, не относится к OPI
//		2. AI_ОбработкаСервер - Необходимо ознакомиться для понимания логики
//		3. AI_ДействияПослеОбработки - для обработки ответов от нейросетей
//		4. AI_RAG - для описания взаимодействия с RAG элементами
//		5. AI_LMStudio - Самописный, не относится к OPI
//	2. Регламентные задания:
//		1. AI_ОбработкаОчередиЗапросов - асинхронная обработка очереди запросов к нейросетям
//		2. AI_ОбработкаОчередиПодготовкиКВекторизации - обработка объектов, подготовка данных для отправки в векторную базу данных
//		3. AI_ОбработкаОчередиВекторизации - получение векторов и запись в векторню базу данных
//	3. Константы:
//		1. AI_ЛогироватьЗапросы - необходимость логировать запросы к нейросетям
//		2. AI_КоличествоПотоковОбработкиОчереди
//		3. AI_КоличествоПопытокОбработкиЗапросаОчереди - лучше ставить не больше 2
//		4. AI_КоличествоПотоковВекторизации
//	4. Справочники:
//		1. AI_Провайдеры:
//			Маршрутизация логики запросов между провайдерами
//		
//			1. Активен - отвечает за включенность использования провайдера
//			2. APIКлюч - Ключ для доступа к апи провайдера
//			3. МаксКоличествоПотоков - отвечает за формирование порций и задает максимальное количество одновременных сессий к провайдеру
//			4. ПровайдерИсточникAPI - Необходимо для возможности наследовать интерфейс OpenAI, Ollama, LMStudio, YandexAI в других провайдерах
//				Табличные части:	
//					1. АдресаСервисов
//						1. БазовыйURL - ендпоинт для доступа к API
//						2. Тип - Chat completion или Responses
//		2. AI_Модели:
//			Необходимы для передачи в HTTP для указания используемой модели.
//				
//			1. Наименование - критично, передается в http
//			2. Описание - описание для чего будет использоваться модель
//			3. FolderID - для Yandex-а для работы в режиме Responses API
//			4. ИдентификаторДляЛогики - Индексированный реквизит для использования в произвольных алгоритмах, 
//																	в настоящий момент использования в конфигураци нет
//		3. AI_Агенты:
//			Один из ключевых элементов. 
//			Задает логику взаимодействия с нейросетью
//			
//			1. СистемнаяИнструкция - задание промта system для базового поведения
//			2. Температура (творчества):
//				0.1 - Только сухие факты
//				1.0 - Режим полной фантазии
//				Для нормальных не сухих ответов рекомендуется использовать значение 0.3
//			3. МаксТокенов - ограничение количества потребляемых токенов в рамках запроса
//			4. ИдентификаторДляЛогики - Используется для обработки ответа модели в:
//						AI_ДействияПослеОбработки.ВыполнитьДействияПослеПолученияОтвета(РезультатОбработки)
//			5. НуженВебПоиск - Включает возможность веб поиска для используемой модели (только для Responses типа API)
//			6. ОкноКонтекстВебПоиска - абстрактное значение ограничивающее потребление токенов для просмотра ресурсов в интернете
//			7. ИзвлекатьОтветВСтруктуру - Задает необходимость извлекать ответ в структуру после получения ответа, 
//																				перед обработкой в модуле AI_ДействияПослеОбработки	
//				Табличные части:
//					1. ДополнительныйКонтекст
//						1. Контекст - выбранный контекст будет включен в сообщение для модели
//					2. RAGКоллекции
//						1. Использовать - флаг использования коллекции агентом
//						2. Коллекция - выбранная векторизированная коллекция данных
//						3. ЛимитФрагментовQdrant - количество возвращаемых векторных совпадений для передачи в контекст модели
//						4. ВесКоллекции - необходимо задавать для рассчета ответа по нескольким коллекциям:
//								Например задан поиск по двум коллекциям:
//									contract
//									counterparty
//								Мы должны обозначить что информация из contract (договора) является более приоритетной по сравнению с counterparty	
//						5. МинПорогСхожести - порог схожести векторов, ниже которого значения не принимаются в контекст
//					3. RAGРазрешения - закладка - которая позволит ограничивать векторный поиск в дальнейшем при разработке библиотеки
//					4. URLДляПоиска - При заполнении, модель будет искать только на выбранных ресурсах
//						URL - ДОМЕН для поиска (именно домен!)
//		4. AI_ДополнительныйКонтекст
//			Отвечает за RAG подобное обогащение контекста перед сообщением, смотрите пример в Обработка.AI_Песочница и Обработка.AI_Клиент
//			
//			1. ДанныеКонтекста - ХранилищеЗначения - строковые данные для передачи в контекст
//			2. ИдентификаторДляЛогики - индексированный реквизит для поиска элемента справочника, позволяет обогащать определенный элемент данными
//			3. ДатаАктуальности - Дата актуальности контекста, для актуализации элемента в логике алгоритма актуализации
//				
//				Для обогащения есть всех элементов есть заглушка в: AI_ОбработкаСервер.ОбогащениеДополнительногоКонтекста
//					где предполагается использование заданного ИдентификатораДляЛогики в элементе
//		5. AI_RAG
//			Справочник для хранения настроек подключений к Embedding сервису и сервису Qdrant (векторная БД)
//				
//		6. AI_RAGКоллекции
//			1. Наименование критично, т.к. используется в алгоритмах
//			2. ОписаниеКоллекции - назначение коллекции
//			3. Тип коллекции - представление типа для Qdrant
//			4. _Overlap - в настоящий момент не используется
//				Табличные части:
//					1. ТипыДанныхКоллекции
//						1. НаименованиеТипаСтрокой - полное имя типа 1С (например: Справочник.МойОбъект) - корректность КРИТИЧНА;
//		7. AI_RAGВидыРазрешений - в настоящее время не используется
//							
//---------------------------------------------------------------------------------
//								ИСПОЛЬЗОВАНИЕ
//---------------------------------------------------------------------------------
//
//	Все взаимодействие сосредоточено вокруг обработки AI_Клиент
//	Примеры использования обработки есть в обработке AI_Песочница
//	
//	Минимальная конфигурация для работы:
//		1. Справочник.AI_Провайдеры
//			1. Заполнить API ключ
//			2. Взвести флаг "Активен"
//			3. Добавить как минимум одну строку в табличную часть с определенным типом API
//		2. Справочник.AI_Модели
//			1. Указать наименование модели вместе с FolderID (например "gpt://<folder_id>/gpt-oss-20b/latest")
//				1.1. Для яндекса так же нужно заполнить Folder ID - для responses типа API
//		3. Справочник.AI_Агенты
//			1. Указать наименование агента
//			2. Указать идентификатор для логики - необходим для использования при обработке ответа агента в:
//								AI_ДействияПослеОбработки.ВыполнитьДействияПослеПолученияОтвета(РезультатОбработки)
//								
//							Данный реквизит индексирован для поиска и использования в алгоритмах	
//								
//			3. Указать температуру
//				от 0.1 до 0.3 - модель оперирует фактами
//				от 0.4 до 0.7 - более творческие ответы
//				от 0.8 до 1 - сильные галюцинации
//			4. Указать необходимость извлечения ответа в структуру для обработки в методе
//								AI_ДействияПослеОбработки.ВыполнитьДействияПослеПолученияОтвета(РезультатОбработки)
//			5. Заполнить инструкцию - для чего нужен агент и задания модели его поведения. Рекомендуется задать формат ответа.
//			6. Указать необходимость использования веб поиска
//				1. Указать окно контекста поиска
//				2. Указать перечень URL ресурсов для поиска (если необходимо ограничить) 

//---------------------------------------------------------------------------------
//								АСИНХРОННЫЙ ВЫЗОВ LLM
//---------------------------------------------------------------------------------
//	Асинхронное взаимодействие с нейросетями:
//		Пакетная обработка запросов к нейросети происходит через РегистрыСведений.AI_ОчередьЗапросов
//			Для поставновки в очередь воспользуйтесь следующим методом:
// 				РегистрыСведений.AI_ОчередьЗапросов.ПоставитьЗапросВОчередь(Провайдер, ТипAPI, Модель, Агент, Промт, ПутьКФайлу="", ДвоичныеДанные=Неопределено)
//			
//			Логика обработки ответа от нейросети описывается в:
//																AI_ДействияПослеОбработки.ВыполнитьДействияПослеПолученияОтвета(РезультатОбработки)
//			Регламентное задание отвечающее за разбор очереди и отправку в LLM:
//																			AI_ОбработкаОчередиЗапросов
//
//---------------------------------------------------------------------------------
//								СИНХРОННЫЙ ВЫЗОВ LLM
//---------------------------------------------------------------------------------
//	Примеры синхронного вызова есть в Обработка.AI_Песочница вызовом метода "Спросить". Ниже практический пример для использования в алгоритмах
//
//		Провайдер = СсылкаНаНастроенныйЭлементПровайдера;
//		Модель = Справочники.AI_Модели.ПолучитьПоИдентификатору("ЯндексГПТПро");
//		Агент = Справочники.AI_Агенты.НайтиПоИдентификаторуЛогики("ОпределениеКодовТНВЭД"); // У агента задана инструкция для определения кодов ТНВЭД по номенклатуре
//		ТипAPI = Перечисления.AI_ТипAPI.Responses; // т.к. предполагаем что нужен поиск на ограниченном перечне интернет ресурсов
//		РежимДиалога = Ложь; // Не нужен в данном кейсе, диалоги в Chat completions поребляют много токенов, в отличии от Responses
//		ГлубинаДиалога = 0; // т.к. диалог не нужен
//
//		ОбъектКлиент = Обработки.AI_Клиент.Создать();
//		ОбъектКлиент.Инициализировать(Провайдер, Модель, ТипAPI, РежимДиалога, ГлубинаДиалога);
//		ОбъектКлиент.ИнициализироватьСистемныйПромт(Агент);
//		ОбъектКлиент.Спросить("Древесный субстрат для шиитаке. Категория: Сырье. Состав: Опилки лиственных пород 80%, солома 20%. Назначение: Для выращивания грибов. Тех. описание: Блоки по 2,35 кг в полипропиленовой упаковке");
//
//		Ответ = ОбъектКлиент.Ответ;
//
//---------------------------------------------------------------------------------
//										RAG
//---------------------------------------------------------------------------------
//
//	Если необходимо использовать векторную базу и индексировать в ней данные самой базы, тогда
//		1. Создать в проекте внедрения подписку на запись нужных объектов и вызвать
//			AI_ОбработкаСервер.AI_RAG_ПередЗаписьюПриЗаписи.
//		2. Описать явную логику разложения объекта в общем модуле "AI_RAG"
//			в процедуре "ОбработкаМассиваОчередиПодготовкиПоТипу".
//			2.1. Данная процедура заполняет регистр сведений "AI_ОчередьВекторизации" который в свою очередь уже выгружается в векторную БД
//				регламентным заданием "AI_ОбработкаОчередиВекторизации" 

			
//---------------------------------------------------------------------------------
//								РАБОТОСПОСОБНОСТЬ
//---------------------------------------------------------------------------------
//
//	На текущий момент (19.05.2026) проверено взаимодействие по следующим кейсам:
//		1. Провайдер Yandex:
//			1. ТипAPI:
//				1. Responses
//					1. Работает Web поиск и ограничение по URL (В AI_Агент-е)
//					2. Передача файлов НЕ РАБОТАЕТ
//				2. ChatCompletion
//			2. Режим диалога:
//				1. Включен
//				2. Выключен
//			3. Доп. контекст:
//				1. С передачей доп. контекста - Справочник.AI_ДополнительныйКонтекст
//				2. Без передачи доп. контекста
//			4. RAG:
//				1. С подключенным RAG
//				2. С отключенным RAG
//					ВАЖНО:
//						В Справочник.AI_Агенты табличная часть RAGРазрешения является заглушкой - ограничения поиска не реализованы
//		2. Провайдер LM Studio
//			1. ТипAPI:
//				1. ChatCompletions
//				
//	На момент тестирования для провайдера Yandex удается использовать OpenAI модуль
//
//
//
