#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если Версия < 1 Тогда
		Версия = 1;
	КонецЕсли;

	ИспользованныеКонтексты = Новый Соответствие;
	Для Каждого СтрокаСостава Из Состав Цикл
		Если Не ЗначениеЗаполнено(СтрокаСостава.Контекст) Тогда
			Продолжить;
		КонецЕсли;
		Если ИспользованныеКонтексты.Получить(СтрокаСостава.Контекст) <> Неопределено Тогда
			Отказ = Истина;
			ВызватьИсключение НСтр("ru = 'Карточка контекста добавлена в набор более одного раза.'");
		КонецЕсли;
		ИспользованныеКонтексты.Вставить(СтрокаСостава.Контекст, Истина);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
