
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Активно = Истина;
	ТипМеста = "Объект";
	Порядок = 100;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если Не ЗначениеЗаполнено(Сценарий) Тогда
		ВызватьИсключение "Укажите сценарий.";
	КонецЕсли;
	Если СтрНайти(",Объект,Список,Раздел,Глобально,", "," + ТипМеста + ",") = 0 Тогда
		ВызватьИсключение "Тип места должен быть одним из значений: Объект, Список, Раздел, Глобально.";
	КонецЕсли;
	Если ТипМеста = "Глобально" Тогда
		ПолноеИмяМетаданных = "";
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПредставлениеКоманды) Тогда
		ПредставлениеКоманды = Строка(Сценарий);
	КонецЕсли;
КонецПроцедуры
