#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() Тогда
		Если Объект.МаксимумВызовов = 0 Тогда
			Объект.МаксимумВызовов = 10;
		КонецЕсли;
		Если Объект.ОбщийТаймаутСекунд = 0 Тогда
			Объект.ОбщийТаймаутСекунд = 120;
		КонецЕсли;
		Если Объект.МаксимальныйРазмерРезультатаБайт = 0 Тогда
			Объект.МаксимальныйРазмерРезультатаБайт = 1048576;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
