
#Область ПрограммныйИнтерфейс

Функция ПолучитьКоллекцииПоПредставлениюТипа(НаименованиеТипаСтрокой) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	AI_RAGКоллекцииТипыДанныхКоллекции.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.AI_RAGКоллекции.ТипыДанныхКоллекции КАК AI_RAGКоллекцииТипыДанныхКоллекции
		|ГДЕ
		|	AI_RAGКоллекцииТипыДанныхКоллекции.НаименованиеТипаСтрокой = &НаименованиеТипаСтрокой";
	
	Запрос.УстановитьПараметр("НаименованиеТипаСтрокой", НаименованиеТипаСтрокой);
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат Результат;
	
КонецФункции 

Функция ПолучитьЗначенияКоллекций(МассивКоллекций) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	AI_RAGКоллекции.Наименование КАК Наименование,
		|	AI_RAGКоллекции.ОписаниеКоллекции КАК ОписаниеКоллекции,
		|	AI_RAGКоллекции.ТипКоллекции КАК ТипКоллекции,
		|	AI_RAGКоллекции.КоллекцияИнициализирована КАК КоллекцияИнициализирована,
		|	AI_RAGКоллекции._Overlap КАК _Overlap,
		|	AI_RAGКоллекции.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.AI_RAGКоллекции КАК AI_RAGКоллекции
		|ГДЕ
		|	AI_RAGКоллекции.Ссылка В(&МассивКоллекций)";
	Запрос.УстановитьПараметр("МассивКоллекций", МассивКоллекций);
	
	ИтоговоеСоответствие = Новый Соответствие;
	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		ИтоговоеСоответствие.Вставить(Результат.Ссылка, Результат);
	КонецЦикла;
	
	Возврат ИтоговоеСоответствие;
	
КонецФункции

#КонецОбласти