
#Область ПрограммныйИнтерфейс

Функция ВсеДанныеПровайдера(Провайдер) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	AI_Провайдеры.Ссылка КАК Ссылка,
		|	AI_Провайдеры.Наименование КАК Наименование,
		|	AI_Провайдеры.Активен КАК Активен,
		|	AI_Провайдеры.APIКлюч КАК APIКлюч,
		|	AI_Провайдеры.ПровайдерИсточникAPI КАК ПровайдерИсточникAPI,
		|	AI_Провайдеры.МаксКоличествоПотоков КАК МаксКоличествоПотоков,
		|	AI_Провайдеры.ЛимитRPM КАК ЛимитRPM
		|ИЗ
		|	Справочник.AI_Провайдеры КАК AI_Провайдеры
		|ГДЕ
		|	AI_Провайдеры.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	AI_ПровайдерыАдресаСервисов.БазовыйURL КАК БазовыйURL,
		|	AI_ПровайдерыАдресаСервисов.Тип КАК Тип
		|ИЗ
		|	Справочник.AI_Провайдеры.АдресаСервисов КАК AI_ПровайдерыАдресаСервисов
		|ГДЕ
		|	AI_ПровайдерыАдресаСервисов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Провайдер);
	
	РезультатПакет = Запрос.ВыполнитьПакет();
	ДанныеПровайдера = РезультатПакет[0].Выбрать();
	ДанныеURL = РезультатПакет[1].Выбрать();
	
	ИтоговаяСтруктура = Новый Структура;
	
	Если ДанныеПровайдера.Следующий() Тогда
		ИтоговаяСтруктура.Вставить("Активен", ДанныеПровайдера.Активен);
		ИтоговаяСтруктура.Вставить("APIКлюч", ДанныеПровайдера.APIКлюч.Получить());
		ИтоговаяСтруктура.Вставить("МаксКоличествоПотоков", ДанныеПровайдера.МаксКоличествоПотоков);
		ИтоговаяСтруктура.Вставить("ЛимитRPM", ДанныеПровайдера.ЛимитRPM);
		ИтоговаяСтруктура.Вставить("ПровайдерИсточникAPI", ДанныеПровайдера.ПровайдерИсточникAPI);
		ИтоговаяСтруктура.Вставить("АдресаСервисов", Новый Соответствие);
	КонецЕсли;
	
	Пока ДанныеURL.Следующий() Цикл
		ИтоговаяСтруктура.АдресаСервисов.Вставить(ДанныеURL.Тип, ДанныеURL.БазовыйURL);
	КонецЦикла;
	
	Возврат ИтоговаяСтруктура;
	
КонецФункции

Функция ТипПоддерживается(Знач Провайдер, ТипАпи) Экспорт
	Если ТипЗнч(Провайдер) = Тип("СправочникСсылка.AI_Провайдеры") Тогда
		СтруктураДанныхПровайдера = ВсеДанныеПровайдера(Провайдер);
	Иначе
		СтруктураДанныхПровайдера = Провайдер;
	КонецЕсли;
	Возврат НЕ СтруктураДанныхПровайдера.АдресаСервисов.Получить(ТипАпи) = Неопределено;
КонецФункции

#КонецОбласти