
#Область СобытияФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДанныеИзОбъекта = ТекущийОбъект.ДанныеКонтекста.Получить();
	Если ЗначениеЗаполнено(ДанныеИзОбъекта) Тогда
		ДанныеКонтекста.УстановитьТекст(ДанныеИзОбъекта);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.ДатаАктуальности = ТекущаяДата();
	
	ОчиститьСообщения();
	
	Текст = ДанныеКонтекста.ПолучитьТекст();
	
	Если Не ЗначениеЗаполнено(Текст) Тогда
		Сообщить("Заполните данные контекста.");
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДанныеКонтекста = Новый ХранилищеЗначения(ДанныеКонтекста.ПолучитьТекст(), Новый СжатиеДанных(9));
КонецПроцедуры

#КонецОбласти