
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИмяПользователяПК = Параметры.ИмяПользователяПК;
	ТекущийЗапрос = Параметры.ТекущийЗапрос;
	
	ОбновитьСписокДляПользователя();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокДляПользователя();
	
	//ХранилищеОбщихНастроек.Загрузить("КонсольЗапросов_ХранимыеЗапросы", СсылкаНаЗапрос, , "_АдминистраторКонсолиЗапросов");
	
	КлючиХранения = РеквизитФормыВЗначение("Объект").КлючиХраненияОбщие();
	
	СписокЗапросов.Очистить();
	
	СписокНастроек = ХранилищеОбщихНастроек.ПолучитьСписок(КлючиХранения.КлючОбъекта, КлючиХранения.ИмяПользователя);
	
	Для Каждого Настройка Из СписокНастроек Цикл
		Если СтрНачинаетсяС(Настройка.Значение, ИмяПользователяПК) Тогда
			
			ДанныеЗапроса = ХранилищеОбщихНастроек.Загрузить(КлючиХранения.КлючОбъекта, Настройка.Значение, , КлючиХранения.ИмяПользователя);
			
			// Для очистки тестовых данных
			Если ДанныеЗапроса = Неопределено Тогда
				ХранилищеОбщихНастроек.Удалить(КлючиХранения.КлючОбъекта, Настройка.Значение, КлючиХранения.ИмяПользователя);
			КонецЕсли;
			
			НовыйЗапрос = СписокЗапросов.Добавить();
			НовыйЗапрос.ИмяЗапроса = ДанныеЗапроса.ИмяЗапроса;
			НовыйЗапрос.ТекстЗапроса = ДанныеЗапроса.Текст;
			НовыйЗапрос.ПараметрыЗапроса = ДанныеЗапроса.Параметры;
			НовыйЗапрос.ВремяСоздания = ДанныеЗапроса.ВремяСоздания;
			НовыйЗапрос.СсылкаНаЗапрос = Настройка.Значение;
			
			ПредставлениеПараметров = Новый ТекстовыйДокумент;
			Для Каждого ПараметрЗапроса Из НовыйЗапрос.ПараметрыЗапроса Цикл
				
				ТипЗначенияПараметра = ТипЗнч(ПараметрЗапроса.Значение);
				
				Если ТипЗначенияПараметра = Тип("ТаблицаЗначений") Тогда
					КоличествоКолонок = ПараметрЗапроса.Значение.Колонки.Количество();
					КоличествоЗаписей = ПараметрЗапроса.Значение.Количество();
					ПредставлениеПараметра = СтрШаблон("Колонки: %1, Строки: %2", КоличествоКолонок, КоличествоЗаписей);
				Иначе
					ПредставлениеПараметра = Строка(ПараметрЗапроса.Значение);
				КонецЕсли;
				
				ПредставлениеПараметров.ДобавитьСтроку(СтрШаблон("%1(Тип: %2) : %3", ПараметрЗапроса.Ключ, ТипЗнч(ПараметрЗапроса.Значение), ПредставлениеПараметра));
				
			КонецЦикла;
			
			НовыйЗапрос.ПредставлениеПараметров = ПредставлениеПараметров.ПолучитьТекст();
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗапросовПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокЗапросов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Предпросмотр.УстановитьТекст(ТекущиеДанные.ТекстЗапроса);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьТекущий(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(ТекущийЗапрос.Текст) Тогда
		Сообщить("Невозможно сохранить пустой запрос.");
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаИмениЗапроса", ЭтаФорма);
	
	ПоказатьВводСтроки(Оповещение, "", "Введите представление запроса");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаИмениЗапроса(ПредставлениеЗапроса, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(ПредставлениеЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьТекущийЗапрос(ПредставлениеЗапроса);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьТекущийЗапрос(ПредставлениеЗапроса)
	
	ИмяХранимогоЗапроса = СтрШаблон("%1_%2", ИмяПользователяПК, Новый УникальныйИдентификатор);
	
	ТекущийЗапрос.Вставить("ИмяЗапроса", ПредставлениеЗапроса);
	ТекущийЗапрос.Вставить("ВремяСоздания", ТекущаяДата());
	
	ХранилищеОбщихНастроек.Сохранить(КлючиХранения.КлючОбъекта, ИмяХранимогоЗапроса, ТекущийЗапрос, , КлючиХранения.ИмяПользователя);
	
	Сообщить("Запрос сохранен.");
	
	// По хорошему нужно просто добавить в текущий список, но разработчики могут халтурить 
	// и не удалять из памяти свои большие и маленькие запросы, пускай специально тормозит (если конечно будет)
	ОбновитьСписокДляПользователя();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВыбранный(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеПодтвержденияУдаления", ЭтаФорма);
	
	ПоказатьВопрос(Оповещение, "Вы уверены что хотите удалить текущий(-ие) запрос(-ы)?", РежимДиалогаВопрос.ДаНет, , , "Подтвердите действие");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияУдаления(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Не Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.СписокЗапросов.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьЗапросНаСервере(ВыделенныеСтроки);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЗапросНаСервере(ВыделенныеСтроки)
	
	Для Каждого ИндексЭлемента Из ВыделенныеСтроки Цикл
		
		ТекущаяСтрока = СписокЗапросов.НайтиПоИдентификатору(ИндексЭлемента);
		
		ХранилищеОбщихНастроек.Удалить(КлючиХранения.КлючОбъекта, ТекущаяСтрока.СсылкаНаЗапрос, КлючиХранения.ИмяПользователя);
		
	КонецЦикла;
	
	ОбновитьСписокДляПользователя();
	
КонецПроцедуры


&НаКлиенте
Процедура СписокЗапросовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбратьТекущий();
КонецПроцедуры


&НаКлиенте
Процедура Выбрать(Команда)
	ВыбратьТекущий();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьТекущий()
	
	ТекущиеДанные = Элементы.СписокЗапросов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПередачи = Новый Структура();
	СтруктураПередачи.Вставить("Текст", ТекущиеДанные.ТекстЗапроса);
	СтруктураПередачи.Вставить("Параметры", ТекущиеДанные.ПараметрыЗапроса);
	СтруктураПередачи.Вставить("ВремяСоздания", ТекущиеДанные.ВремяСоздания);
	
	Закрыть(СтруктураПередачи);
	
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьПоСсылке(Команда)
	
	ОчиститьСообщения();
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаЧужойСсылки", ЭтаФорма);
	
	ПоказатьВводСтроки(Оповещение, "", "Введите ссылку");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЧужойСсылки(ЧужаяСсылка, ДополнительныеПараметры) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(ЧужаяСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗапросИзХранилищаПоСсылке(ЧужаяСсылка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗапросИзХранилищаПоСсылке(СсылкаНаЗапрос)
	
	СтруктураЗапроса = ХранилищеОбщихНастроек.Загрузить(КлючиХранения.КлючОбъекта, СсылкаНаЗапрос, , КлючиХранения.ИмяПользователя);
	
	Если СтруктураЗапроса = Неопределено Тогда
		Сообщить("Запрос по ссылке не найден.");
		Возврат;
	КонецЕсли;
	
	ИмяХранимогоЗапроса = СтрШаблон("%1_%2", ИмяПользователяПК, Новый УникальныйИдентификатор);
	
	ТекущийЗапрос.Вставить("ИмяЗапроса", СтрШаблон("%1 (%2)", СтруктураЗапроса.ИмяЗапроса, "скопированный"));
	ТекущийЗапрос.Вставить("ВремяСоздания", ТекущаяДата());
	
	ХранилищеОбщихНастроек.Сохранить(КлючиХранения.КлючОбъекта, ИмяХранимогоЗапроса, ТекущийЗапрос, , КлючиХранения.ИмяПользователя);
	
	ОбновитьСписокДляПользователя();
	
	Сообщить("Запрос по ссылке скопирован.");

КонецПроцедуры