// @strict-types


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Загрузить(ЗначениеИзСтрокиВнутр(Параметры.ВходящаяТаблица));
	
	ТекущийВСписке = Список.НайтиСтроки(Новый Структура("Идентификатор", Параметры.ТекущийИдентификатор))[0];
	ИндексСтроки = Список.Индекс(ТекущийВСписке);
	Элементы.Список.ТекущаяСтрока = ИндексСтроки;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВернутьРодителю();
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьРодителю()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("ВесьСписок, ТекущийКод, Идентификатор", ВесьКодВнутр(), ТекущиеДанные.ТекстКода, ТекущиеДанные.Идентификатор);
	
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВернутьРодителю();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Предпросмотр.УстановитьТекст(ТекущиеДанные.ТекстКода);
	
КонецПроцедуры

&НаСервере
Функция ВесьКодВнутр()
	Возврат ЗначениеВСтрокуВнутр(Список.Выгрузить());
КонецФункции

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Идентификатор) Тогда
		ТекущиеДанные.Идентификатор = Новый УникальныйИдентификатор;
	КонецЕсли;
	
КонецПроцедуры
