
// В модуле описываются действия которые необходимо выполнить после обработки нейросетью. Для обработки результата запроса
// Связь между логикой текущего модуля и работой нейросети осуществляется через значение реквизита ИдентификаторДляЛогики справочника AI_Промпты
#Область СлужебныеПроцедурыИФункции

//	Процедура является связью между ответом нейросетей и логикой обработки внутри 1С
//	Параметры:
//		РезультатОбработки - Структура - Содержит в себе ключи:
//			* ОтветСтрокой - Json строка
//			* Ответ - Структура из JSON-a (если возможно преобразовать)
Процедура ВыполнитьДействияПослеПолученияОтвета(РезультатОбработки) Экспорт
	
	Если РезультатОбработки.ИдентификаторДляЛогики = "Привет мир" Тогда
		ЗаписьЖурналаРегистрации("Привет мир!", УровеньЖурналаРегистрации.Информация, , , РезультатОбработки.ОтветСтрокой);
	ИначеЕсли РезультатОбработки.ИдентификаторДляЛогики = "" Тогда
		// Реализуйте свою логику здесь
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти   

//#TODO 
// Реализовать в каждом справочнике в котором есть "ИдентификаторДляЛогики" проверку уникальности значения, вероятно через подписку