#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
&НаКлиенте
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ОбъектыНазначенияМассив) Экспорт

	Если ИдентификаторКоманды <> "ОткрытьAIПомощник" Тогда
		Возврат;
	КонецЕсли;
	AI_ИнтерфейсныеСценарииКлиент.ОткрытьПомощник(
		ОбъектыНазначенияМассив,
		"Объект");

КонецПроцедуры
